{
  "Riftmarked Knight": "Protection from black; flanking (Whenever a creature without flanking blocks this creature, the blocking creature gets -1/-1 until end of turn.)\n\nSuspend 3—{1}{W}{W} (Rather than cast this card from your hand, you may pay {1}{W}{W} and exile it with three time counters on it. At the beginning of your upkeep, remove a time counter. When the last is removed, cast it without paying its mana cost. It has haste.)\n\nWhen the last time counter is removed from Riftmarked Knight while it's exiled, put a 2/2 black Knight creature token with flanking, protection from white, and haste onto the battlefield.", 
  "Wurmcalling": "Buyback {2}{G} (You may pay an additional {2}{G} as you cast this spell. If you do, put this card into your hand as it resolves.)\n\nPut an X/X green Wurm creature token onto the battlefield.", 
  "Pride of the Clouds": "Flying\n\nPride of the Clouds gets +1/+1 for each other creature with flying on the battlefield.\n\nForecast — {2}{W}{U}, Reveal Pride of the Clouds from your hand: Put a 1/1 white and blue Bird creature token with flying onto the battlefield. (Activate this ability only during your upkeep and only once each turn.)", 
  "Kemba, Kha Regent": "At the beginning of your upkeep, put a 2/2 white Cat creature token onto the battlefield for each Equipment attached to Kemba, Kha Regent.", 
  "Marrow-Gnawer": "Rat creatures have fear. (They can't be blocked except by artifact creatures and/or black creatures.)\n\n{T}, Sacrifice a Rat: Put X 1/1 black Rat creature tokens onto the battlefield, where X is the number of Rats you control.", 
  "Giant Caterpillar": "{G}, Sacrifice Giant Caterpillar: Put a 1/1 green Insect creature token with flying named Butterfly onto the battlefield at the beginning of the next end step.", 
  "Spawning Pit": "Sacrifice a creature: Put a charge counter on Spawning Pit.\n\n{1}, Remove two charge counters from Spawning Pit: Put a 2/2 colorless Spawn artifact creature token onto the battlefield.", 
  "Nameless Race": "Trample\n\nAs Nameless Race enters the battlefield, pay any amount of life. The amount you pay can't be more than the total number of white nontoken permanents your opponents control plus the total number of white cards in their graveyards.\n\nNameless Race's power and toughness are each equal to the life paid as it entered the battlefield.", 
  "Cobra Trap": "If a noncreature permanent under your control was destroyed this turn by a spell or ability an opponent controlled, you may pay {G} rather than pay Cobra Trap's mana cost.\n\nPut four 1/1 green Snake creature tokens onto the battlefield.", 
  "Boris Devilboon": "{2}{B}{R}, {T}: Put a 1/1 black and red Demon creature token named Minor Demon onto the battlefield.", 
  "Violet Pall": "Destroy target nonblack creature. Put a 1/1 black Faerie Rogue creature token with flying onto the battlefield.", 
  "Purgatory": "Whenever a nontoken creature is put into your graveyard from the battlefield, exile that card.\n\nAt the beginning of your upkeep, you may pay {4} and 2 life. If you do, return a card exiled with Purgatory to the battlefield.", 
  "Psychotrope Thallid": "At the beginning of your upkeep, put a spore counter on Psychotrope Thallid.\n\nRemove three spore counters from Psychotrope Thallid: Put a 1/1 green Saproling creature token onto the battlefield.\n\n{1}, Sacrifice a Saproling: Draw a card.", 
  "Verdant Embrace": "Enchant creature\n\nEnchanted creature gets +3/+3 and has \"At the beginning of each upkeep, put a 1/1 green Saproling creature token onto the battlefield.\"", 
  "Brood Sliver": "Whenever a Sliver deals combat damage to a player, its controller may put a 1/1 colorless Sliver creature token onto the battlefield.", 
  "Soul Foundry": "Imprint — When Soul Foundry enters the battlefield, you may exile a creature card from your hand.\n\n{X}, {T}: Put a token that's a copy of the exiled card onto the battlefield. X is the converted mana cost of that card.", 
  "Emrakul's Hatcher": "When Emrakul's Hatcher enters the battlefield, put three 0/1 colorless Eldrazi Spawn creature tokens onto the battlefield. They have \"Sacrifice this creature: Add {1} to your mana pool.\"", 
  "Look Skyward and Despair": "When you set this scheme in motion, put a 5/5 red Dragon creature token with flying onto the battlefield.", 
  "Elephant Resurgence": "Each player puts a green Elephant creature token onto the battlefield. Those creatures have \"This creature's power and toughness are each equal to the number of creature cards in its controller's graveyard.\"", 
  "Wurmcoil Engine": "Deathtouch, lifelink\n\nWhen Wurmcoil Engine dies, put a 3/3 colorless Wurm artifact creature token with deathtouch and a 3/3 colorless Wurm artifact creature token with lifelink onto the battlefield.", 
  "Helm of Kaldra": "Equipped creature has first strike, trample, and haste.\n\n{1}: If you control Equipment named Helm of Kaldra, Sword of Kaldra, and Shield of Kaldra, put a legendary 4/4 colorless Avatar creature token named Kaldra onto the battlefield and attach those Equipment to it.\n\nEquip {2}", 
  "Kuldotha Rebirth": "As an additional cost to cast Kuldotha Rebirth, sacrifice an artifact.\n\nPut three 1/1 red Goblin creature tokens onto the battlefield.", 
  "Patagia Viper": "Flying\n\nWhen Patagia Viper enters the battlefield, put two 1/1 green and blue Snake creature tokens onto the battlefield.\n\nWhen Patagia Viper enters the battlefield, sacrifice it unless {U} was spent to cast it.", 
  "Jungle Patrol": "{1}{G}, {T}:  Put a 0/1 green Wall creature token with defender named Wood onto the battlefield.\n\nSacrifice a token named Wood: Add {R} to your mana pool.", 
  "Harvester of Souls": "Deathtouch\n\nWhenever another nontoken creature dies, you may draw a card.", 
  "Thunderheads": "Replicate {2}{U} (When you cast this spell, copy it for each time you paid its replicate cost.)\n\nPut a 3/3 blue Weird creature token with defender and flying onto the battlefield. Exile it at the beginning of the next end step.", 
  "Myr Turbine": "{T}: Put a 1/1 colorless Myr artifact creature token onto the battlefield.\n\n{T}, Tap five untapped Myr you control: Search your library for a Myr creature card, put it onto the battlefield, then shuffle your library.", 
  "Havengul Runebinder": "{2}{U}, {T}, Exile a creature card from your graveyard: Put a 2/2 black Zombie creature token onto the battlefield, then put a +1/+1 counter on each Zombie creature you control.", 
  "Gods' Eye, Gate to the Reikai": "{T}: Add {1} to your mana pool.\n\nWhen Gods' Eye, Gate to the Reikai is put into a graveyard from the battlefield, put a 1/1 colorless Spirit creature token onto the battlefield.", 
  "Mimic Vat": "Imprint — Whenever a nontoken creature dies, you may exile that card. If you do, return each other card exiled with Mimic Vat to its owner's graveyard.\n\n{3}, {T}: Put a token onto the battlefield that's a copy of the exiled card. It gains haste. Exile it at the beginning of the next end step.", 
  "Stolen Identity": "Put a token onto the battlefield that's a copy of target artifact or creature.\n\nCipher (Then you may exile this spell card encoded on a creature you control. Whenever that creature deals combat damage to a player, its controller may cast a copy of the encoded card without paying its mana cost.)", 
  "Wall of Kelp": "Defender (This creature can't attack.)\n\n{U}{U}, {T}: Put a 0/1 blue Plant Wall creature token with defender named Kelp onto the battlefield.", 
  "Thallid Germinator": "At the beginning of your upkeep, put a spore counter on Thallid Germinator.\n\nRemove three spore counters from Thallid Germinator: Put a 1/1 green Saproling creature token onto the battlefield.\n\nSacrifice a Saproling: Target creature gets +1/+1 until end of turn.", 
  "Acorn Catapult": "{1}, {T}: Acorn Catapult deals 1 damage to target creature or player. That creature's controller or that player puts a 1/1 green Squirrel creature token onto the battlefield.", 
  "Garruk, the Veil-Cursed": "+1: Put a 1/1 black Wolf creature token with deathtouch onto the battlefield.\n\n-1: Sacrifice a creature. If you do, search your library for a creature card, reveal it, put it into your hand, then shuffle your library.\n\n-3: Creatures you control gain trample and get +X/+X until end of turn, where X is the number of creature cards in your graveyard.", 
  "Cenn's Enlistment": "Put two 1/1 white Kithkin Soldier creature tokens onto the battlefield.\n\nRetrace (You may cast this card from your graveyard by discarding a land card in addition to paying its other costs.)", 
  "Beck // Call (Call)": "Put four 1/1 white Bird creature tokens with flying onto the battlefield.\n\nFuse (You may cast one or both halves of this card from your hand.)", 
  "Dogged Hunter": "{T}: Destroy target creature token.", 
  "Hunted Lammasu": "Flying\n\nWhen Hunted Lammasu enters the battlefield, target opponent puts a 4/4 black Horror creature token onto the battlefield.", 
  "Vitu-Ghazi Guildmage": "{4}{G}{W}: Put a 3/3 green Centaur creature token onto the battlefield.\n\n{2}{G}{W}: Populate. (Put a token onto the battlefield that's a copy of a creature token you control.)", 
  "Walker of the Grove": "When Walker of the Grove leaves the battlefield, put a 4/4 green Elemental creature token onto the battlefield.\n\nEvoke {4}{G} (You may cast this spell for its evoke cost. If you do, it's sacrificed when it enters the battlefield.)", 
  "Phyrexian Rebirth": "Destroy all creatures, then put an X/X colorless Horror artifact creature token onto the battlefield, where X is the number of creatures destroyed this way.", 
  "Phantom General": "Creature tokens you control get +1/+1.", 
  "Tetravus": "Flying\n\nTetravus enters the battlefield with three +1/+1 counters on it.\n\nAt the beginning of your upkeep, you may remove any number of +1/+1 counters from Tetravus. If you do, put that many 1/1 colorless Tetravite artifact creature tokens onto the battlefield. They each have flying and \"This creature can't be enchanted.\"\n\nAt the beginning of your upkeep, you may exile any number of tokens put onto the battlefield with Tetravus. If you do, put that many +1/+1 counters on Tetravus.", 
  "Ixidron": "As Ixidron enters the battlefield, turn all other nontoken creatures face down. (They're 2/2 creatures.)\n\nIxidron's power and toughness are each equal to the number of face-down creatures on the battlefield.", 
  "Skinwing": "Living weapon (When this Equipment enters the battlefield, put a 0/0 black Germ creature token onto the battlefield, then attach this to it.)\n\nEquipped creature gets +2/+2 and has flying.\n\nEquip {6}", 
  "Sarpadian Empires, Vol. VII": "As Sarpadian Empires, Vol. VII enters the battlefield, choose white Citizen, blue Camarid, black Thrull, red Goblin, or green Saproling.\n\n{3}, {T}: Put a 1/1 creature token of the chosen color and type onto the battlefield.", 
  "Bifurcate": "Search your library for a permanent card with the same name as target nontoken creature and put that card onto the battlefield. Then shuffle your library.", 
  "Trostani's Judgment": "Exile target creature, then populate. (Put a token onto the battlefield that's a copy of a creature token you control.)", 
  "Tomb of Urami": "{T}: Add {B} to your mana pool. Tomb of Urami deals 1 damage to you if you don't control an Ogre.\n\n{2}{B}{B}, {T}, Sacrifice all lands you control: Put a legendary 5/5 black Demon Spirit creature token with flying named Urami onto the battlefield.", 
  "Pegasus Stampede": "Buyback—Sacrifice a land. (You may sacrifice a land in addition to any other costs as you cast this spell. If you do, put this card into your hand as it resolves.)\n\nPut a 1/1 white Pegasus creature token with flying onto the battlefield.", 
  "Baloth Cage Trap": "If an opponent had an artifact enter the battlefield under his or her control this turn, you may pay {1}{G} rather than pay Baloth Cage Trap's mana cost.\n\nPut a 4/4 green Beast creature token onto the battlefield.", 
  "Rith, the Awakener Avatar": "Whenever a creature you control deals combat damage to a player, you may pay {5}. If you do, put a 5/5 red Dragon creature token with flying onto the battlefield.", 
  "Spider Spawning": "Put a 1/2 green Spider creature token with reach onto the battlefield for each creature card in your graveyard.\n\nFlashback {6}{B} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", 
  "Talrand's Invocation": "Put two 2/2 blue Drake creature tokens with flying onto the battlefield.", 
  "Caribou Range": "Enchant land you control\n\nEnchanted land has \"{W}{W}, {T}: Put a 0/1 white Caribou creature token onto the battlefield.\"\n\nSacrifice a Caribou token: You gain 1 life.", 
  "Peacekeeper Avatar": "{3}: For each opponent who controls a creature, put a token onto the battlefield that's a copy of a card named Arrest and attach it to a creature that player controls chosen at random.", 
  "Wolf-Skull Shaman": "Kinship — At the beginning of your upkeep, you may look at the top card of your library. If it shares a creature type with Wolf-Skull Shaman, you may reveal it. If you do, put a 2/2 green Wolf creature token onto the battlefield.", 
  "Nemata, Grove Guardian": "{2}{G}: Put a 1/1 green Saproling creature token onto the battlefield.\n\nSacrifice a Saproling: Saproling creatures get +1/+1 until end of turn.", 
  "Penumbra Wurm": "Trample\n\nWhen Penumbra Wurm dies, put a 6/6 black Wurm creature token with trample onto the battlefield.", 
  "Devastating Summons": "As an additional cost to cast Devastating Summons, sacrifice X lands.\n\nPut two X/X red Elemental creature tokens onto the battlefield.", 
  "Sharding Sphinx": "Flying\n\nWhenever an artifact creature you control deals combat damage to a player, you may put a 1/1 blue Thopter artifact creature token with flying onto the battlefield.", 
  "Broodhatch Nantuko": "Whenever Broodhatch Nantuko is dealt damage, you may put that many 1/1 green Insect creature tokens onto the battlefield.\n\nMorph {2}{G} (You may cast this face down as a 2/2 creature for {3}. Turn it face up any time for its morph cost.)", 
  "Spitting Image": "Put a token that's a copy of target creature onto the battlefield.\n\nRetrace (You may cast this card from your graveyard by discarding a land card in addition to paying its other costs.)", 
  "Stitcher's Apprentice": "{1}{U}, {T}: Put a 2/2 blue Homunculus creature token onto the battlefield, then sacrifice a creature.", 
  "Sacred Mesa": "At the beginning of your upkeep, sacrifice Sacred Mesa unless you sacrifice a Pegasus.\n\n{1}{W}: Put a 1/1 white Pegasus creature token with flying onto the battlefield.", 
  "Endless Swarm": "Put a 1/1 green Snake creature token onto the battlefield for each card in your hand.\n\nEpic (For the rest of the game, you can't cast spells. At the beginning of each of your upkeeps, copy this spell except for its epic ability.)", 
  "Progenitor Mimic": "You may have Progenitor Mimic enter the battlefield as a copy of any creature on the battlefield except it gains \"At the beginning of your upkeep, if this creature isn't a token, put a token onto the battlefield that's a copy of this creature.\"", 
  "Kjeldoran Outpost": "If Kjeldoran Outpost would enter the battlefield, sacrifice a Plains instead. If you do, put Kjeldoran Outpost onto the battlefield. If you don't, put it into its owner's graveyard.\n\n{T}: Add {W} to your mana pool.\n\n{1}{W}, {T}: Put a 1/1 white Soldier creature token onto the battlefield.", 
  "Korozda Guildmage": "{1}{B}{G}: Target creature gets +1/+1 and gains intimidate until end of turn.\n\n{2}{B}{G}, Sacrifice a nontoken creature: Put X 1/1 green Saproling creature tokens onto the battlefield, where X is the sacrificed creature's toughness.", 
  "Bottle of Suleiman": "{1}, Sacrifice Bottle of Suleiman: Flip a coin. If you lose the flip, Bottle of Suleiman deals 5 damage to you. If you win the flip, put a 5/5 colorless Djinn artifact creature token with flying onto the battlefield.", 
  "Sliver Queen": "{2}: Put a 1/1 colorless Sliver creature token onto the battlefield.", 
  "Creakwood Liege": "Other black creatures you control get +1/+1.\n\nOther green creatures you control get +1/+1.\n\nAt the beginning of your upkeep, you may put a 1/1 black and green Worm creature token onto the battlefield.", 
  "Time Machine": "{T}: Remove Time Machine and target nontoken creature you own from the game. Return both cards to play at the beginning of your upkeep on your turn X of the next game you play with the same opponent, where X is the removed creature's converted mana cost.", 
  "Forbidden Orchard": "{T}: Add one mana of any color to your mana pool.\n\nWhenever you tap Forbidden Orchard for mana, target opponent puts a 1/1 colorless Spirit creature token onto the battlefield.", 
  "Sprouting Thrinax": "When Sprouting Thrinax dies, put three 1/1 green Saproling creature tokens onto the battlefield.", 
  "Flash Foliage": "Cast Flash Foliage only during combat after blockers are declared.\n\nPut a 1/1 green Saproling creature token onto the battlefield blocking target creature attacking you.\n\nDraw a card.", 
  "Verdant Succession": "Whenever a green nontoken creature dies, that creature's controller may search his or her library for a card with the same name as that creature and put it onto the battlefield. If that player does, he or she shuffles his or her library.", 
  "Dreampod Druid": "At the beginning of each upkeep, if Dreampod Druid is enchanted, put a 1/1 green Saproling creature token onto the battlefield.", 
  "Saber Ants": "Whenever Saber Ants is dealt damage, you may put that many 1/1 green Insect creature tokens onto the battlefield.", 
  "Garruk, Primal Hunter": "+1: Put a 3/3 green Beast creature token onto the battlefield.\n\n-3: Draw cards equal to the greatest power among creatures you control.\n\n-6: Put a 6/6 green Wurm creature token onto the battlefield for each land you control.", 
  "Nomads' Assembly": "Put a 1/1 white Kor Soldier creature token onto the battlefield for each creature you control.\n\nRebound (If you cast this spell from your hand, exile it as it resolves. At the beginning of your next upkeep, you may cast this card from exile without paying its mana cost.)", 
  "Timely Reinforcements": "If you have less life than an opponent, you gain 6 life. If you control fewer creatures than an opponent, put three 1/1 white Soldier creature tokens onto the battlefield.", 
  "Slime Molding": "Put an X/X green Ooze creature token onto the battlefield.", 
  "Nut Collector": "At the beginning of your upkeep, you may put a 1/1 green Squirrel creature token onto the battlefield.\n\nThreshold — Squirrel creatures get +2/+2 as long as seven or more cards are in your graveyard.", 
  "Dance of Many": "When Dance of Many enters the battlefield, put a token that's a copy of target nontoken creature onto the battlefield.\n\nWhen Dance of Many leaves the battlefield, exile the token.\n\nWhen the token leaves the battlefield, sacrifice Dance of Many.\n\nAt the beginning of your upkeep, sacrifice Dance of Many unless you pay {U}{U}.", 
  "Chicken Egg": "During your upkeep, roll a six-sided die. On a 6, sacrifice Chicken Egg and put a Giant Chicken token into play. Treat this token as a 4/4 red creature that counts as a Chicken.", 
  "Beast Attack": "Put a 4/4 green Beast creature token onto the battlefield.\n\nFlashback {2}{G}{G}{G} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", 
  "Call of the Conclave": "Put a 3/3 green Centaur creature token onto the battlefield.", 
  "Survey the Wreckage": "Destroy target land. Put a 1/1 red Goblin creature token onto the battlefield.", 
  "Call of the Nightwing": "Put a 1/1 blue and black Horror creature token with flying onto the battlefield.\n\nCipher (Then you may exile this spell card encoded on a creature you control. Whenever that creature deals combat damage to a player, its controller may cast a copy of the encoded card without paying its mana cost.)", 
  "Marath, Will of the Wild": "Marath, Will of the Wild enters the battlefield with a number of +1/+1 counters on it equal to the amount of mana spent to cast it.\n\n{X}, Remove X +1/+1 counters from Marath: Choose one — Put X +1/+1 counters on target creature; or Marath deals X damage to target creature or player; or put an X/X green Elemental creature token onto the battlefield. X can't be 0.", 
  "Intangible Virtue": "Creature tokens you control get +1/+1 and have vigilance.", 
  "Morbid Bloom": "Exile target creature card from a graveyard, then put X 1/1 green Saproling creature tokens onto the battlefield, where X is the exiled card's toughness.", 
  "Higure, the Still Wind Avatar": "Whenever a nontoken creature you control deals combat damage to an opponent, choose a creature card at random from your library, reveal that card, and put it into your hand. Then shuffle your library.", 
  "Sensor Splicer": "When Sensor Splicer enters the battlefield, put a 3/3 colorless Golem artifact creature token onto the battlefield.\n\nGolem creatures you control have vigilance.", 
  "Cornered Market": "Players can't cast spells with the same name as a nontoken permanent.\n\nPlayers can't play nonbasic lands with the same name as a nontoken permanent.", 
  "Mycologist": "At the beginning of your upkeep, put a spore counter on Mycologist.\n\nRemove three spore counters from Mycologist: Put a 1/1 green Saproling creature token onto the battlefield.\n\nSacrifice a Saproling: You gain 2 life.", 
  "Dune-Brood Nephilim": "Whenever Dune-Brood Nephilim deals combat damage to a player, put a 1/1 colorless Sand creature token onto the battlefield for each land you control.", 
  "Jade Mage": "{2}{G}: Put a 1/1 green Saproling creature token onto the battlefield.", 
  "Primal Vigor": "If one or more tokens would be put onto the battlefield, twice that many of those tokens are put onto the battlefield instead.\n\nIf one or more +1/+1 counters would be placed on a creature, twice that many +1/+1 counters are placed on that creature instead.", 
  "Metrognome": "When a spell or ability an opponent controls causes you to discard Metrognome, put four 1/1 colorless Gnome artifact creature tokens onto the battlefield.\n\n{4}, {T}: Put a 1/1 colorless Gnome artifact creature token onto the battlefield.", 
  "Master of the Hunt": "{2}{G}{G}: Put a 1/1 green Wolf creature token named Wolves of the Hunt onto the battlefield. It has \"bands with other creatures named Wolves of the Hunt.\" (Any creatures named Wolves of the Hunt can attack in a band as long as at least one has \"bands with other creatures named Wolves of the Hunt.\" Bands are blocked as a group. If at least two creatures named Wolves of the Hunt you control, one of which has \"bands with other creatures named Wolves of the Hunt,\" are blocking or being blocked by the same creature, you divide that creature's combat damage, not its controller, among any of the creatures it's being blocked by or is blocking.)", 
  "Nemesis Trap": "If a white creature is attacking, you may pay {B}{B} rather than pay Nemesis Trap's mana cost.\n\nExile target attacking creature. Put a token that's a copy of that creature onto the battlefield. Exile it at the beginning of the next end step.", 
  "Talrand, Sky Summoner": "Whenever you cast an instant or sorcery spell, put a 2/2 blue Drake creature token with flying onto the battlefield.", 
  "Murder Investigation": "Enchant creature you control\n\nWhen enchanted creature dies, put X 1/1 white Soldier creature tokens onto the battlefield, where X is its power.", 
  "Sek'Kuar, Deathkeeper": "Whenever another nontoken creature you control dies, put a 3/1 black and red Graveborn creature token with haste onto the battlefield.", 
  "Emeria Angel": "Flying\n\nLandfall — Whenever a land enters the battlefield under your control, you may put a 1/1 white Bird creature token with flying onto the battlefield.", 
  "Voice of Resurgence": "Whenever an opponent casts a spell during your turn or when Voice of Resurgence dies, put a green and white Elemental creature token onto the battlefield with \"This creature's power and toughness are each equal to the number of creatures you control.\"", 
  "Lys Alana Huntmaster": "Whenever you cast an Elf spell, you may put a 1/1 green Elf Warrior creature token onto the battlefield.", 
  "Words of Wilding": "{1}: The next time you would draw a card this turn, put a 2/2 green Bear creature token onto the battlefield instead.", 
  "Pulse of the Tangle": "Put a 3/3 green Beast creature token onto the battlefield. Then if an opponent controls more creatures than you, return Pulse of the Tangle to its owner's hand.", 
  "Kalitas, Bloodchief of Ghet": "{B}{B}{B}, {T}: Destroy target creature. If that creature dies this way, put a black Vampire creature token onto the battlefield. Its power is equal to that creature's power and its toughness is equal to that creature's toughness.", 
  "Krenko, Mob Boss": "{T}: Put X 1/1 red Goblin creature tokens onto the battlefield, where X is the number of Goblins you control.", 
  "Master of the Wild Hunt Avatar": "{2}{G}: Put a green creature token onto the battlefield that's a 2/2 Wolf, a 2/3 Antelope with forestwalk, a 3/2 Cat with shroud, or a 4/4 green Rhino with trample, chosen at random.", 
  "Spawning Grounds": "Enchant land\n\nEnchanted land has \"{T}: Put a 5/5 green Beast creature token with trample onto the battlefield.\"", 
  "Jund": "Whenever a player casts a black, red, or green creature spell, it gains devour 5. (As the creature enters the battlefield, its controller may sacrifice any number of creatures. The creature enters the battlefield with five times that many +1/+1 counters on it.)\n\nWhenever you roll chaos, put two 1/1 red Goblin creature tokens onto the battlefield.", 
  "Grand Ossuary": "Whenever a creature dies, its controller distributes a number of +1/+1 counters equal to its power among any number of target creatures he or she controls.\n\nWhenever you roll chaos, each player exiles all creatures he or she controls and puts X 1/1 green Saproling creature tokens onto the battlefield, where X is the total power of the creatures he or she exiled this way. Then planeswalk.", 
  "Dripping-Tongue Zubera": "When Dripping-Tongue Zubera dies, put a 1/1 colorless Spirit creature token onto the battlefield for each Zubera that died this turn.", 
  "Call to Arms": "As Call to Arms enters the battlefield, choose a color and an opponent.\n\nWhite creatures get +1/+1 as long as the chosen color is the most common color among nontoken permanents the chosen player controls but isn't tied for most common.\n\nWhen the chosen color isn't the most common color among nontoken permanents the chosen player controls or is tied for most common, sacrifice Call to Arms.", 
  "Captain's Call": "Put three 1/1 white Soldier creature tokens onto the battlefield.", 
  "Thieves' Auction": "Exile all nontoken permanents. Starting with you, each player chooses one of the exiled cards and puts it onto the battlefield tapped under his or her control. Repeat this process until all cards exiled this way have been chosen.", 
  "Ib Halfheart, Goblin Tactician": "Whenever another Goblin you control becomes blocked, sacrifice it. If you do, it deals 4 damage to each creature blocking it.\n\nSacrifice two Mountains: Put two 1/1 red Goblin creature tokens onto the battlefield.", 
  "Symbol Status": "Put a 1/1 colorless Expansion-Symbol creature token into play for each different expansion symbol among permanents you control.", 
  "Bloodhill Bastion": "Whenever a creature enters the battlefield, it gains double strike and haste until end of turn.\n\nWhenever you roll chaos, exile target nontoken creature you control, then return it to the battlefield under your control.", 
  "Form of the Squirrel": "As Form of the Squirrel comes into play, put a 1/1 green Squirrel creature token into play. You lose the game when it leaves play.\n\nCreatures can't attack you.\n\nYou can't be the target of spells or abilities.\n\nYou can't play spells.", 
  "Patrol Signaler": "{1}{W}, {Q}: Put a 1/1 white Kithkin Soldier creature token onto the battlefield. ({Q} is the untap symbol.)", 
  "Guardian of Cloverdell": "When Guardian of Cloverdell enters the battlefield, put three 1/1 white Kithkin Soldier creature tokens onto the battlefield.\n\n{G}, Sacrifice a Kithkin: You gain 1 life.", 
  "Momir Vig, Simic Visionary Avatar": "{X}, Discard a card: Put a token onto the battlefield that's a copy of a creature card with converted mana cost X chosen at random. Activate this ability only any time you could cast a sorcery and only once each turn.", 
  "Undead Alchemist": "If a Zombie you control would deal combat damage to a player, instead that player puts that many cards from the top of his or her library into his or her graveyard.\n\nWhenever a creature card is put into an opponent's graveyard from his or her library, exile that card and put a 2/2 black Zombie creature token onto the battlefield.", 
  "Increasing Devotion": "Put five 1/1 white Human creature tokens onto the battlefield. If Increasing Devotion was cast from a graveyard, put ten of those tokens onto the battlefield instead.\n\nFlashback {7}{W}{W} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", 
  "Rith's Charm": "Choose one — Destroy target nonbasic land; or put three 1/1 green Saproling creature tokens onto the battlefield; or prevent all damage a source of your choice would deal this turn.", 
  "Sprout": "Put a 1/1 green Saproling creature token onto the battlefield.", 
  "Selesnya Loft Gardens": "If an effect would put one or more tokens onto the battlefield, it puts twice that many of those tokens onto the battlefield instead.\n\nIf an effect would place one or more counters on a permanent, it places twice that many of those counters on that permanent instead.\n\nWhenever you roll chaos, until end of turn, whenever you tap a land for mana, add one mana to your mana pool of any type that land produced.", 
  "Rotlung Reanimator": "Whenever Rotlung Reanimator or another Cleric dies, put a 2/2 black Zombie creature token onto the battlefield.", 
  "Flourishing Defenses": "Whenever a -1/-1 counter is placed on a creature, you may put a 1/1 green Elf Warrior creature token onto the battlefield.", 
  "Blade Splicer": "When Blade Splicer enters the battlefield, put a 3/3 colorless Golem artifact creature token onto the battlefield.\n\nGolem creatures you control have first strike.", 
  "Nested Ghoul": "Whenever a source deals damage to Nested Ghoul, put a 2/2 black Zombie creature token onto the battlefield.", 
  "Benalish Commander": "Benalish Commander's power and toughness are each equal to the number of Soldiers you control.\n\nSuspend X—{X}{W}{W}. X can't be 0. (Rather than cast this card from your hand, you may pay {X}{W}{W} and exile it with X time counters on it. At the beginning of your upkeep, remove a time counter. When the last is removed, cast it without paying its mana cost. It has haste.)\n\nWhenever a time counter is removed from Benalish Commander while it's exiled, put a 1/1 white Soldier creature token onto the battlefield.", 
  "Security Detail": "{W}{W}: Put a 1/1 white Soldier creature token onto the battlefield. Activate this ability only if you control no creatures and only once each turn.", 
  "Summoner's Bane": "Counter target creature spell. Put a 2/2 blue Illusion creature token onto the battlefield.", 
  "Psychic Allergy": "As Psychic Allergy enters the battlefield, choose a color.\n\nAt the beginning of each opponent's upkeep, Psychic Allergy deals X damage to that player, where X is the number of nontoken permanents of the chosen color he or she controls.\n\nAt the beginning of your upkeep, destroy Psychic Allergy unless you sacrifice two Islands.", 
  "Infernal Genesis": "At the beginning of each player's upkeep, that player puts the top card of his or her library into his or her graveyard. Then he or she puts X 1/1 black Minion creature tokens onto the battlefield, where X is that card's converted mana cost.", 
  "Howl of the Night Pack": "Put a 2/2 green Wolf creature token onto the battlefield for each Forest you control.", 
  "Kozilek's Predator": "When Kozilek's Predator enters the battlefield, put two 0/1 colorless Eldrazi Spawn creature tokens onto the battlefield. They have \"Sacrifice this creature: Add {1} to your mana pool.\"", 
  "Mobilization": "Soldier creatures have vigilance. (Attacking doesn't cause them to tap.)\n\n{2}{W}: Put a 1/1 white Soldier creature token onto the battlefield.", 
  "Gelatinous Genesis": "Put X X/X green Ooze creature tokens onto the battlefield.", 
  "Goblin Warrens": "{2}{R}, Sacrifice two Goblins: Put three 1/1 red Goblin creature tokens onto the battlefield.", 
  "Geist of Saint Traft": "Hexproof (This creature can't be the target of spells or abilities your opponents control.)\n\nWhenever Geist of Saint Traft attacks, put a 4/4 white Angel creature token with flying onto the battlefield tapped and attacking. Exile that token at end of combat.", 
  "Elgaud Inquisitor": "Lifelink (Damage dealt by this creature also causes you to gain that much life.)\n\nWhen Elgaud Inquisitor dies, put a 1/1 white Spirit creature token with flying onto the battlefield.", 
  "The Fourth Sphere": "At the beginning of your upkeep, sacrifice a nonblack creature.\n\nWhenever you roll {C}, put a 2/2 black Zombie creature token onto the battlefield.", 
  "White Sun's Zenith": "Put X 2/2 white Cat creature tokens onto the battlefield. Shuffle White Sun's Zenith into its owner's library.", 
  "Beast Within": "Destroy target permanent. Its controller puts a 3/3 green Beast creature token onto the battlefield.", 
  "City in a Bottle": "Whenever a nontoken permanent originally printed in the Arabian Nights expansion other than City in a Bottle is on the battlefield, its controller sacrifices it.\n\nPlayers can't play cards originally printed in the Arabian Nights expansion.", 
  "Mercy Killing": "Target creature's controller sacrifices it, then puts X 1/1 green and white Elf Warrior creature tokens onto the battlefield, where X is that creature's power.", 
  "Goblin Marshal": "Echo {4}{R}{R} (At the beginning of your upkeep, if this came under your control since the beginning of your last upkeep, sacrifice it unless you pay its echo cost.)\n\nWhen Goblin Marshal enters the battlefield or dies, put two 1/1 red Goblin creature tokens onto the battlefield.", 
  "Sosuke's Summons": "Put two 1/1 green Snake creature tokens onto the battlefield.\n\nWhenever a nontoken Snake enters the battlefield under your control, you may return Sosuke's Summons from your graveyard to your hand.", 
  "Join the Ranks": "Put two 1/1 white Soldier Ally creature tokens onto the battlefield.", 
  "Wirewood Hivemaster": "Whenever another nontoken Elf enters the battlefield, you may put a 1/1 green Insect creature token onto the battlefield.", 
  "Funeral Pyre": "Exile target card from a graveyard. Its owner puts a 1/1 white Spirit creature token with flying onto the battlefield.", 
  "Luminous Angel": "Flying\n\nAt the beginning of your upkeep, you may put a 1/1 white Spirit creature token with flying onto the battlefield.", 
  "Supply // Demand (Supply)": "Put X 1/1 green Saproling creature tokens onto the battlefield.", 
  "Hammer of Purphoros": "Creatures you control have haste.\n\n{2}{R}, {T}, Sacrifice a land: Put a 3/3 colorless Golem enchantment artifact creature token onto the battlefield.", 
  "Hoofprints of the Stag": "Whenever you draw a card, you may put a hoofprint counter on Hoofprints of the Stag.\n\n{2}{W}, Remove four hoofprint counters from Hoofprints of the Stag: Put a 4/4 white Elemental creature token with flying onto the battlefield. Activate this ability only during your turn.", 
  "Doomed Traveler": "When Doomed Traveler dies, put a 1/1 white Spirit creature token with flying onto the battlefield.", 
  "Echo Chamber": "{4}, {T}: An opponent chooses target creature he or she controls. Put a token that's a copy of that creature onto the battlefield. That token gains haste until end of turn. Exile the token at the beginning of the next end step. Activate this ability only any time you could cast a sorcery.", 
  "Lightning Coils": "Whenever a nontoken creature you control dies, put a charge counter on Lightning Coils.\n\nAt the beginning of your upkeep, if Lightning Coils has five or more charge counters on it, remove all of them from it and put that many 3/1 red Elemental creature tokens with haste onto the battlefield. Exile them at the beginning of the next end step.", 
  "Flametongue Kavu Avatar": "Whenever a nontoken creature enters the battlefield under your control, that creature deals X damage to target creature, where X is a number chosen at random from 0 to 4.", 
  "Rukh Egg": "When Rukh Egg dies, put a 4/4 red Bird creature token with flying onto the battlefield at the beginning of the next end step.", 
  "Emmara Tandris": "Prevent all damage that would be dealt to creature tokens you control.", 
  "It That Betrays": "Annihilator 2 (Whenever this creature attacks, defending player sacrifices two permanents.)\n\nWhenever an opponent sacrifices a nontoken permanent, put that card onto the battlefield under your control.", 
  "Imperious Perfect": "Other Elf creatures you control get +1/+1.\n\n{G}, {T}: Put a 1/1 green Elf Warrior creature token onto the battlefield.", 
  "Elephant Ambush": "Put a 3/3 green Elephant creature token onto the battlefield.\n\nFlashback {6}{G}{G} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", 
  "Golgari Germination": "Whenever a nontoken creature you control dies, put a 1/1 green Saproling creature token onto the battlefield.", 
  "Breeding Pit": "At the beginning of your upkeep, sacrifice Breeding Pit unless you pay {B}{B}.\n\nAt the beginning of your end step, put a 0/1 black Thrull creature token onto the battlefield.", 
  "Beckon Apparition": "Exile target card from a graveyard. Put a 1/1 white and black Spirit creature token with flying onto the battlefield.", 
  "Zektar Shrine Expedition": "Landfall — Whenever a land enters the battlefield under your control, you may put a quest counter on Zektar Shrine Expedition.\n\nRemove three quest counters from Zektar Shrine Expedition and sacrifice it: Put a 7/1 red Elemental creature token with trample and haste onto the battlefield. Exile it at the beginning of the next end step.", 
  "Springjack Shepherd": "Chroma — When Springjack Shepherd enters the battlefield, put a 0/1 white Goat creature token onto the battlefield for each white mana symbol in the mana costs of permanents you control.", 
  "Mask of the Mimic": "As an additional cost to cast Mask of the Mimic, sacrifice a creature.\n\nSearch your library for a card with the same name as target nontoken creature and put that card onto the battlefield. Then shuffle your library.", 
  "Infinite Reflection": "Enchant creature\n\nWhen Infinite Reflection enters the battlefield attached to a creature, each other nontoken creature you control becomes a copy of that creature.\n\nNontoken creatures you control enter the battlefield as a copy of enchanted creature.", 
  "Parallel Evolution": "For each creature token on the battlefield, its controller puts a token that's a copy of that creature onto the battlefield.\n\nFlashback {4}{G}{G}{G} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", 
  "Ajani, Caller of the Pride": "+1: Put a +1/+1 counter on up to one target creature.\n\n-3: Target creature gains flying and double strike until end of turn.\n\n-8: Put X 2/2 white Cat creature tokens onto the battlefield, where X is your life total.", 
  "Akroan Horse": "Defender\n\nWhen Akroan Horse enters the battlefield, an opponent gains control of it.\n\nAt the beginning of your upkeep, each opponent puts a 1/1 white Soldier creature token onto the battlefield.", 
  "Dragon Roost": "{5}{R}{R}: Put a 5/5 red Dragon creature token with flying onto the battlefield. (It can't be blocked except by creatures with flying or reach.)", 
  "Skeletonize": "Skeletonize deals 3 damage to target creature. When a creature dealt damage this way dies this turn, put a 1/1 black Skeleton creature token onto the battlefield with \"{B}: Regenerate this creature.\"", 
  "Jund Battlemage": "{B}, {T}: Target player loses 1 life.\n\n{G}, {T}: Put a 1/1 green Saproling creature token onto the battlefield.", 
  "Hornet Queen": "Flying, deathtouch\n\nWhen Hornet Queen enters the battlefield, put four 1/1 green Insect creature tokens with flying and deathtouch onto the battlefield.", 
  "Myr Incubator": "{6}, {T}, Sacrifice Myr Incubator: Search your library for any number of artifact cards, exile them, then put that many 1/1 colorless Myr artifact creature tokens onto the battlefield. Then shuffle your library.", 
  "Symbiotic Wurm": "When Symbiotic Wurm dies, put seven 1/1 green Insect creature tokens onto the battlefield.", 
  "Tombstone Stairwell": "Cumulative upkeep {1}{B} (At the beginning of your upkeep, put an age counter on this permanent, then sacrifice it unless you pay its upkeep cost for each age counter on it.)\n\nAt the beginning of each upkeep, if Tombstone Stairwell is on the battlefield, each player puts a 2/2 black Zombie creature token with haste named Tombspawn onto the battlefield for each creature card in his or her graveyard.\n\nAt the beginning of each end step or when Tombstone Stairwell leaves the battlefield, destroy all tokens put onto the battlefield with Tombstone Stairwell. They can't be regenerated.", 
  "Mercenary Informer": "Mercenary Informer can't be the target of black spells or abilities from black sources.\n\n{2}{W}: Put target nontoken Mercenary on the bottom of its owner's library.", 
  "Lullmage Mentor": "Whenever a spell or ability you control counters a spell, you may put a 1/1 blue Merfolk creature token onto the battlefield.\n\nTap seven untapped Merfolk you control: Counter target spell.", 
  "Rotted Ones, Lay Siege": "When you set this scheme in motion, for each opponent, put a 2/2 black Zombie creature token onto the battlefield that attacks that player each combat if able.", 
  "Storm Herd": "Put X 1/1 white Pegasus creature tokens with flying onto the battlefield, where X is your life total.", 
  "Molten Birth": "Put two 1/1 red Elemental creature tokens onto the battlefield. Then flip a coin. If you win the flip, return Molten Birth to its owner's hand.", 
  "Ophiomancer": "At the beginning of each upkeep, if you control no Snakes, put a 1/1 black Snake creature token with deathtouch onto the battlefield.", 
  "Strandwalker": "Living weapon (When this Equipment enters the battlefield, put a 0/0 black Germ creature token onto the battlefield, then attach this to it.)\n\nEquipped creature gets +2/+4 and has reach.\n\nEquip {4}", 
  "Moonsilver Spear": "Equipped creature has first strike.\n\nWhenever equipped creature attacks, put a 4/4 white Angel creature token with flying onto the battlefield.\n\nEquip {4}", 
  "Sliver Queen, Brood Mother": "{3}: Put a 1/1 colorless Sliver creature token onto the battlefield.", 
  "Bonehoard": "Living weapon (When this Equipment enters the battlefield, put a 0/0 black Germ creature token onto the battlefield, then attach this to it.)\n\nEquipped creature gets +X/+X, where X is the number of creature cards in all graveyards.\n\nEquip {2}", 
  "Deadly Grub": "Vanishing 3 (This permanent enters the battlefield with three time counters on it. At the beginning of your upkeep, remove a time counter from it. When the last is removed, sacrifice it.)\n\nWhen Deadly Grub dies, if it had no time counters on it, put a 6/1 green Insect creature token with shroud onto the battlefield. (It can't be the target of spells or abilities.)", 
  "Lashwrithe": "Living weapon (When this Equipment enters the battlefield, put a 0/0 black Germ creature token onto the battlefield, then attach this to it.)\n\nEquipped creature gets +1/+1 for each Swamp you control.\n\nEquip {(b/p){(b/p)} ({(b/p)} can be paid with either {B} or 2 life.)", 
  "Summon the School": "Put two 1/1 blue Merfolk Wizard creature tokens onto the battlefield.\n\nTap four untapped Merfolk you control: Return Summon the School from your graveyard to your hand.", 
  "Precursor Golem": "When Precursor Golem enters the battlefield, put two 3/3 colorless Golem artifact creature tokens onto the battlefield.\n\nWhenever a player casts an instant or sorcery spell that targets only a single Golem, that player copies that spell for each other Golem that spell could target. Each copy targets a different one of those Golems.", 
  "Spiny Starfish": "{U}: Regenerate Spiny Starfish.\n\nAt the beginning of each end step, if Spiny Starfish regenerated this turn, put a 0/1 blue Starfish creature token onto the battlefield for each time it regenerated this turn.", 
  "Lich Lord of Unx": "{U}{B}, {T}: Put a 1/1 blue and black Zombie Wizard creature token onto the battlefield.\n\n{U}{U}{B}{B}: Target player loses X life and puts the top X cards of his or her library into his or her graveyard, where X is the number of Zombies you control.", 
  "Sickleslicer": "Living weapon (When this Equipment enters the battlefield, put a 0/0 black Germ creature token onto the battlefield, then attach this to it.)\n\nEquipped creature gets +2/+2.\n\nEquip {4}", 
  "Conversion Chamber": "{2}, {T}: Exile target artifact card from a graveyard. Put a charge counter on Conversion Chamber.\n\n{2}, {T}, Remove a charge counter from Conversion Chamber: Put a 3/3 colorless Golem artifact creature token onto the battlefield.", 
  "Utopia Mycon": "At the beginning of your upkeep, put a spore counter on Utopia Mycon.\n\nRemove three spore counters from Utopia Mycon: Put a 1/1 green Saproling creature token onto the battlefield.\n\nSacrifice a Saproling: Add one mana of any color to your mana pool.", 
  "Sarcomancy": "When Sarcomancy enters the battlefield, put a 2/2 black Zombie creature token onto the battlefield.\n\nAt the beginning of your upkeep, if there are no Zombies on the battlefield, Sarcomancy deals 1 damage to you.", 
  "Ovinomancer": "When Ovinomancer enters the battlefield, sacrifice it unless you return three basic lands you control to their owner's hand.\n\n{T}, Return Ovinomancer to its owner's hand: Destroy target creature. It can't be regenerated. That creature's controller puts a 0/1 green Sheep creature token onto the battlefield.", 
  "Gilt-Leaf Ambush": "Put two 1/1 green Elf Warrior creature tokens onto the battlefield. Clash with an opponent. If you win, those creatures gain deathtouch until end of turn. (Each clashing player reveals the top card of his or her library, then puts that card on the top or bottom. A player wins if his or her card had a higher converted mana cost. Any amount of damage a creature with deathtouch deals to a creature is enough to destroy it.)", 
  "Springjack Pasture": "{T}: Add {1} to your mana pool.\n\n{4}, {T}: Put a 0/1 white Goat creature token onto the battlefield.\n\n{T}, Sacrifice X Goats: Add X mana of any one color to your mana pool. You gain X life.", 
  "Glimmervoid Basin": "Whenever a player casts an instant or sorcery spell with a single target, he or she copies that spell for each other spell, permanent, card not on the battlefield, and/or player the spell could target. Each copy targets a different one of them.\n\nWhenever you roll {C}, choose target creature. Each player except that creature's controller puts a token that's a copy of that creature onto the battlefield.", 
  "Gwyllion Hedge-Mage": "When Gwyllion Hedge-Mage enters the battlefield, if you control two or more Plains, you may put a 1/1 white Kithkin Soldier creature token onto the battlefield.\n\nWhen Gwyllion Hedge-Mage enters the battlefield, if you control two or more Swamps, you may put a -1/-1 counter on target creature.", 
  "Akroan Crusader": "Heroic — Whenever you cast a spell that targets Akroan Crusader, put a 1/1 red Soldier creature token with haste onto the battlefield.", 
  "Rhys the Redeemed": "{2}{G/W}, {T}: Put a 1/1 green and white Elf Warrior creature token onto the battlefield.\n\n{4}{G/W}{G/W}, {T}: For each creature token you control, put a token that's a copy of that creature onto the battlefield.", 
  "Siege-Gang Commander": "When Siege-Gang Commander enters the battlefield, put three 1/1 red Goblin creature tokens onto the battlefield.\n\n{1}{R}, Sacrifice a Goblin: Siege-Gang Commander deals 2 damage to target creature or player.", 
  "Marsh Flitter": "Flying\n\nWhen Marsh Flitter enters the battlefield, put two 1/1 black Goblin Rogue creature tokens onto the battlefield.\n\nSacrifice a Goblin: Marsh Flitter becomes 3/3 until end of turn.", 
  "Giant Adephage": "Trample\n\nWhenever Giant Adephage deals combat damage to a player, put a token onto the battlefield that's a copy of Giant Adephage.", 
  "Diamond Kaleidoscope": "{3}, {T}: Put a 0/1 colorless Prism artifact creature token onto the battlefield.\n\nSacrifice a Prism token: Add one mana of any color to your mana pool.", 
  "Minion Reflector": "Whenever a nontoken creature enters the battlefield under your control, you may pay {2}. If you do, put a token that's a copy of that creature onto the battlefield. That token has haste and \"At the beginning of the end step, sacrifice this permanent.\"", 
  "Myr Matrix": "Indestructible (Effects that say \"destroy\" don't destroy this artifact.)\n\nMyr creatures get +1/+1.\n\n{5}: Put a 1/1 colorless Myr artifact creature token onto the battlefield.", 
  "Urbis Protector": "When Urbis Protector enters the battlefield, put a 4/4 white Angel creature token with flying onto the battlefield.", 
  "Avenger of Zendikar": "When Avenger of Zendikar enters the battlefield, put a 0/1 green Plant creature token onto the battlefield for each land you control.\n\nLandfall — Whenever a land enters the battlefield under your control, you may put a +1/+1 counter on each Plant creature you control.", 
  "Lab Rats": "Buyback {4} (You may pay an additional {4} as you cast this spell. If you do, put this card into your hand as it resolves.)\n\nPut a 1/1 black Rat creature token onto the battlefield.", 
  "Goldmeadow Lookout": "{W}, {T}, Discard a card: Put a 1/1 white Kithkin Soldier creature token named Goldmeadow Harrier onto the battlefield. It has \"{W}, {T}: Tap target creature.\"", 
  "Kharasha Foothills": "Whenever a creature you control attacks a player, for each other opponent, you may put a token that's a copy of that creature onto the battlefield tapped and attacking that opponent. Exile those tokens at the beginning of the next end step.\n\nWhenever you roll chaos, you may sacrifice any number of creatures. If you do, Kharasha Foothills deals that much damage to target creature.", 
  "Elemental Appeal": "Kicker {5} (You may pay an additional {5} as you cast this spell.)\n\nPut a 7/1 red Elemental creature token with trample and haste onto the battlefield. Exile it at the beginning of the next end step. If Elemental Appeal was kicked, that creature gets +7/+0 until end of turn.", 
  "Baku Altar": "Whenever you cast a Spirit or Arcane spell, you may put a ki counter on Baku Altar.\n\n{2}, {T}, Remove a ki counter from Baku Altar: Put a 1/1 colorless Spirit creature token onto the battlefield.", 
  "Uktabi Kong": "Trample\n\nWhen Uktabi Kong comes into play, destroy all artifacts.\n\nTap two untapped Apes you control: Put a 1/1 green Ape creature token into play.", 
  "Shiv": "All creatures have \"{R}: This creature gets +1/+0 until end of turn.\"\n\nWhenever you roll {C}, put a 5/5 red Dragon creature token with flying onto the battlefield.", 
  "Hunted Horror": "Trample\n\nWhen Hunted Horror enters the battlefield, target opponent puts two 3/3 green Centaur creature tokens with protection from black onto the battlefield.", 
  "Homarid Spawning Bed": "{1}{U}{U}, Sacrifice a blue creature: Put X 1/1 blue Camarid creature tokens onto the battlefield, where X is the sacrificed creature's converted mana cost.", 
  "Bazaar of Wonders": "When Bazaar of Wonders enters the battlefield, exile all cards from all graveyards.\n\nWhenever a player casts a spell, counter it if a card with the same name is in a graveyard or a nontoken permanent with the same name is on the battlefield.", 
  "Swan Song": "Counter target enchantment, instant, or sorcery spell. Its controller puts a 2/2 blue Bird creature token with flying onto the battlefield.", 
  "Garruk Wildspeaker": "+1: Untap two target lands.\n\n-1: Put a 3/3 green Beast creature token onto the battlefield.\n\n-4: Creatures you control get +3/+3 and gain trample until end of turn.", 
  "Sunspire Gatekeepers": "When Sunspire Gatekeepers enters the battlefield, if you control two or more Gates, put a 2/2 white Knight creature token with vigilance onto the battlefield.", 
  "Thallid Devourer": "At the beginning of your upkeep, put a spore counter on Thallid Devourer.\n\nRemove three spore counters from Thallid Devourer: Put a 1/1 green Saproling creature token onto the battlefield.\n\nSacrifice a Saproling: Thallid Devourer gets +1/+2 until end of turn.", 
  "Druid's Deliverance": "Prevent all combat damage that would be dealt to you this turn. Populate. (Put a token onto the battlefield that's a copy of a creature token you control.)", 
  "Mogg Infestation": "Destroy all creatures target player controls. For each creature that died this way, put two 1/1 red Goblin creature tokens onto the battlefield under that player's control.", 
  "Seller of Songbirds": "When Seller of Songbirds enters the battlefield, put a 1/1 white Bird creature token with flying onto the battlefield.", 
  "Dread Drone": "When Dread Drone enters the battlefield, put two 0/1 colorless Eldrazi Spawn creature tokens onto the battlefield. They have \"Sacrifice this creature: Add {1} to your mana pool.\"", 
  "Prowess of the Fair": "Whenever another nontoken Elf is put into your graveyard from the battlefield, you may put a 1/1 green Elf Warrior creature token onto the battlefield.", 
  "Verdeloth the Ancient": "Kicker {X} (You may pay an additional {X} as you cast this spell.)\n\nSaproling creatures and other Treefolk creatures get +1/+1.\n\nWhen Verdeloth the Ancient enters the battlefield, if it was kicked, put X 1/1 green Saproling creature tokens onto the battlefield.", 
  "Druidic Satchel": "{2}, {T}: Reveal the top card of your library. If it's a creature card, put a 1/1 green Saproling creature token onto the battlefield. If it's a land card, put that card onto the battlefield under your control. If it's a noncreature, nonland card, you gain 2 life.", 
  "Eyes of the Wisent": "Whenever an opponent casts a blue spell during your turn, you may put a 4/4 green Elemental creature token onto the battlefield.", 
  "Promise of Power": "Choose one — You draw five cards and you lose 5 life; or put an X/X black Demon creature token with flying onto the battlefield, where X is the number of cards in your hand as the token enters the battlefield.\n\nEntwine {4} (Choose both if you pay the entwine cost.)", 
  "Teysa, Orzhov Scion": "Sacrifice three white creatures: Exile target creature.\n\nWhenever another black creature you control dies, put a 1/1 white Spirit creature token with flying onto the battlefield.", 
  "Triskelavus": "Flying\n\nTriskelavus enters the battlefield with three +1/+1 counters on it.\n\n{1}, Remove a +1/+1 counter from Triskelavus: Put a 1/1 colorless Triskelavite artifact creature token with flying onto the battlefield. It has \"Sacrifice this creature: This creature deals 1 damage to target creature or player.\"", 
  "Master's Call": "Put two 1/1 colorless Myr artifact creature tokens onto the battlefield.", 
  "Tempt with Reflections": "Tempting offer — Choose target creature you control. Put a token onto the battlefield that's a copy of that creature. Each opponent may put a token onto the battlefield that's a copy of that creature. For each opponent who does, put a token onto the battlefield that's a copy of that creature.", 
  "Warren Weirding": "Target player sacrifices a creature. If a Goblin is sacrificed this way, that player puts two 1/1 black Goblin Rogue creature tokens onto the battlefield, and those tokens gain haste until end of turn.", 
  "Day of the Dragons": "When Day of the Dragons enters the battlefield, exile all creatures you control. Then put that many 5/5 red Dragon creature tokens with flying onto the battlefield.\n\nWhen Day of the Dragons leaves the battlefield, sacrifice all Dragons you control. Then return the exiled cards to the battlefield under your control.", 
  "Haunted Angel": "Flying\n\nWhen Haunted Angel dies, exile Haunted Angel and each other player puts a 3/3 black Angel creature token with flying onto the battlefield.", 
  "Wren's Run Packmaster": "Champion an Elf (When this enters the battlefield, sacrifice it unless you exile another Elf you control. When this leaves the battlefield, that card returns to the battlefield.)\n\n{2}{G}: Put a 2/2 green Wolf creature token onto the battlefield.\n\nEach Wolf you control has deathtouch. (Any amount of damage it deals to a creature is enough to destroy that creature.)", 
  "Goblin Assault": "At the beginning of your upkeep, put a 1/1 red Goblin creature token with haste onto the battlefield.\n\nGoblin creatures attack each turn if able.", 
  "Bridge from Below": "Whenever a nontoken creature is put into your graveyard from the battlefield, if Bridge from Below is in your graveyard, put a 2/2 black Zombie creature token onto the battlefield.\n\nWhen a creature is put into an opponent's graveyard from the battlefield, if Bridge from Below is in your graveyard, exile Bridge from Below.", 
  "Decree of Justice": "Put X 4/4 white Angel creature tokens with flying onto the battlefield.\n\nCycling {2}{W} ({2}{W}, Discard this card: Draw a card.)\n\nWhen you cycle Decree of Justice, you may pay {X}. If you do, put X 1/1 white Soldier creature tokens onto the battlefield.", 
  "Mongrel Pack": "When Mongrel Pack dies during combat, put four 1/1 green Hound creature tokens onto the battlefield.", 
  "Garruk Relentless": "When Garruk Relentless has two or fewer loyalty counters on him, transform him.\n\n0: Garruk Relentless deals 3 damage to target creature. That creature deals damage equal to its power to him.\n\n0: Put a 2/2 green Wolf creature token onto the battlefield.", 
  "Crib Swap": "Changeling (This card is every creature type at all times.)\n\nExile target creature. Its controller puts a 1/1 colorless Shapeshifter creature token with changeling onto the battlefield.", 
  "Seed Spark": "Destroy target artifact or enchantment. If {G} was spent to cast Seed Spark, put two 1/1 green Saproling creature tokens onto the battlefield.", 
  "Golgothian Sylex": "{1}, {T}: Each nontoken permanent originally printed in the Antiquities expansion is sacrificed by its controller.", 
  "Primeval Bounty": "Whenever you cast a creature spell, put a 3/3 green Beast creature token onto the battlefield.\n\nWhenever you cast a noncreature spell, put three +1/+1 counters on target creature you control.\n\nWhenever a land enters the battlefield under your control, you gain 3 life.", 
  "Carrion Call": "Put two 1/1 green Insect creature tokens with infect onto the battlefield. (They deal damage to creatures in the form of -1/-1 counters and to players in the form of poison counters.)", 
  "Boggart Mob": "Champion a Goblin (When this enters the battlefield, sacrifice it unless you exile another Goblin you control. When this leaves the battlefield, that card returns to the battlefield.)\n\nWhenever a Goblin you control deals combat damage to a player, you may put a 1/1 black Goblin Rogue creature token onto the battlefield.", 
  "Blaze Commando": "Whenever an instant or sorcery spell you control deals damage, put two 1/1 red and white Soldier creature tokens with haste onto the battlefield.", 
  "Abhorrent Overlord": "Flying\n\nWhen Abhorrent Overlord enters the battlefield, put a number of 1/1 black Harpy creature tokens with flying onto the battlefield equal to your devotion to black. (Each {B} in the mana costs of permanents you control counts toward your devotion to black.)\n\nAt the beginning of your upkeep, sacrifice a creature.", 
  "Serpent Generator": "{4}, {T}: Put a 1/1 colorless Snake artifact creature token onto the battlefield. It has \"Whenever this creature deals damage to a player, that player gets a poison counter.\" (A player with ten or more poison counters loses the game.)", 
  "Utvara Hellkite": "Flying\n\nWhenever a Dragon you control attacks, put a 6/6 red Dragon creature token with flying onto the battlefield.", 
  "Savage Thallid": "At the beginning of your upkeep, put a spore counter on Savage Thallid.\n\nRemove three spore counters from Savage Thallid: Put a 1/1 green Saproling creature token onto the battlefield.\n\nSacrifice a Saproling: Regenerate target Fungus.", 
  "Phyrexian Swarmlord": "Infect (This creature deals damage to creatures in the form of -1/-1 counters and to players in the form of poison counters.)\n\nAt the beginning of your upkeep, put a 1/1 green Insect creature token with infect onto the battlefield for each poison counter your opponents have.", 
  "Xenagos, the Reveler": "+1: Add X mana in any combination of {R} and/or {G} to your mana pool, where X is the number of creatures you control.\n\n0: Put a 2/2 red and green Satyr creature token with haste onto the battlefield.\n\n-6: Exile the top seven cards of your library. You may put any number of creature and/or land cards from among them onto the battlefield.", 
  "Deathpact Angel": "Flying\n\nWhen Deathpact Angel dies, put a 1/1 white and black Cleric creature token onto the battlefield. It has \"{3}{W}{B}{B}, {T}, Sacrifice this creature: Return a card named Deathpact Angel from your graveyard to the battlefield.\"", 
  "Back from the Brink": "Exile a creature card from your graveyard and pay its mana cost: Put a token onto the battlefield that's a copy of that card. Activate this ability only any time you could cast a sorcery.", 
  "Overburden": "Whenever a player puts a nontoken creature onto the battlefield, that player returns a land he or she controls to its owner's hand.", 
  "Broodmate Dragon": "Flying\n\nWhen Broodmate Dragon enters the battlefield, put a 4/4 red Dragon creature token with flying onto the battlefield.", 
  "Spirit Cairn": "Whenever a player discards a card, you may pay {W}. If you do, put a 1/1 white Spirit creature token with flying onto the battlefield.", 
  "Rebel Informer": "Rebel Informer can't be the target of white spells or abilities from white sources.\n\n{3}: Put target nontoken Rebel on the bottom of its owner's library.", 
  "Sigil of the Empty Throne": "Whenever you cast an enchantment spell, put a 4/4 white Angel creature token with flying onto the battlefield.", 
  "Fertile Imagination": "Choose a card type. Target opponent reveals his or her hand. Put two 1/1 green Saproling creature tokens onto the battlefield for each card of the chosen type revealed this way. (Artifact, creature, enchantment, instant, land, planeswalker, sorcery, and tribal are card types.)", 
  "Kazandu Tuskcaller": "Level up {1}{G} ({1}{G}: Put a level counter on this. Level up only as a sorcery.)\n\nLEVEL 2-5\n\n1/1\n\n{T}: Put a 3/3 green Elephant creature token onto the battlefield.\n\nLEVEL 6+\n\n1/1\n\n{T}: Put two 3/3 green Elephant creature tokens onto the battlefield.", 
  "Thallid Shell-Dweller": "Defender\n\nAt the beginning of your upkeep, put a spore counter on Thallid Shell-Dweller.\n\nRemove three spore counters from Thallid Shell-Dweller: Put a 1/1 green Saproling creature token onto the battlefield.", 
  "Shrine of Loyal Legions": "At the beginning of your upkeep or whenever you cast a white spell, put a charge counter on Shrine of Loyal Legions.\n\n{3}, {T}, Sacrifice Shrine of Loyal Legions: Put a 1/1 colorless Myr artifact creature token onto the battlefield for each charge counter on Shrine of Loyal Legions.", 
  "Endless Ranks of the Dead": "At the beginning of your upkeep, put X 2/2 black Zombie creature tokens onto the battlefield, where X is half the number of Zombies you control, rounded down.", 
  "Liliana's Reaver": "Deathtouch (Any amount of damage this deals to a creature is enough to destroy it.)\n\nWhenever Liliana's Reaver deals combat damage to a player, that player discards a card and you put a 2/2 black Zombie creature token onto the battlefield tapped.", 
  "Saproling Infestation": "Whenever a player kicks a spell, you put a 1/1 green Saproling creature token onto the battlefield.", 
  "Master of Waves": "Protection from red\n\nElemental creatures you control get +1/+1.\n\nWhen Master of Waves enters the battlefield, put a number of 1/0 blue Elemental creature tokens onto the battlefield equal to your devotion to blue. (Each {U} in the mana costs of permanents you control counts toward your devotion to blue.)", 
  "Huntmaster of the Fells": "Whenever this creature enters the battlefield or transforms into Huntmaster of the Fells, put a 2/2 green Wolf creature token onto the battlefield and you gain 2 life.\n\nAt the beginning of each upkeep, if no spells were cast last turn, transform Huntmaster of the Fells.", 
  "Knightly Valor": "Enchant creature\n\nWhen Knightly Valor enters the battlefield, put a 2/2 white Knight creature token with vigilance onto the battlefield.\n\nEnchanted creature gets +2/+2 and has vigilance.", 
  "Sunhome Guildmage": "{1}{R}{W}: Creatures you control get +1/+0 until end of turn.\n\n{2}{R}{W}: Put a 1/1 red and white Soldier creature token with haste onto the battlefield.", 
  "Last Stand": "Target opponent loses 2 life for each Swamp you control. Last Stand deals damage equal to the number of Mountains you control to target creature. Put a 1/1 green Saproling creature token onto the battlefield for each Forest you control. You gain 2 life for each Plains you control. Draw a card for each Island you control, then discard that many cards.", 
  "Splintering Wind": "{2}{G}: Splintering Wind deals 1 damage to target creature. Put a 1/1 green Splinter creature token onto the battlefield. It has flying and \"Cumulative upkeep {G}.\" When it leaves the battlefield, it deals 1 damage to you and each creature you control. (At the beginning of its controller's upkeep, that player puts an age counter on it, then sacrifices it unless he or she pays its upkeep cost for each age counter on it.)", 
  "Ordered Migration": "Domain — Put a 1/1 blue Bird creature token with flying onto the battlefield for each basic land type among lands you control.", 
  "Symbiotic Elf": "When Symbiotic Elf dies, put two 1/1 green Insect creature tokens onto the battlefield.", 
  "Commander's Authority": "Enchant creature\n\nEnchanted creature has \"At the beginning of your upkeep, put a 1/1 white Human creature token onto the battlefield.\"", 
  "Seed the Land": "Whenever a land enters the battlefield, its controller puts a 1/1 green Snake creature token onto the battlefield.", 
  "Brood Birthing": "If you control an Eldrazi Spawn, put three 0/1 colorless Eldrazi Spawn creature tokens onto the battlefield. They have \"Sacrifice this creature: Add {1} to your mana pool.\" Otherwise, put one of those tokens onto the battlefield.", 
  "Phantasmal Sphere": "Flying\n\nAt the beginning of your upkeep, put a +1/+1 counter on Phantasmal Sphere, then sacrifice Phantasmal Sphere unless you pay {1} for each +1/+1 counter on it.\n\nWhen Phantasmal Sphere leaves the battlefield, target opponent puts a blue Orb creature token with flying onto the battlefield. That creature's power and toughness are each equal to the number of +1/+1 counters on Phantasmal Sphere.", 
  "The Hive": "{5}, {T}: Put a 1/1 colorless Insect artifact creature token with flying named Wasp onto the battlefield. (It can't be blocked except by creatures with flying or reach.)", 
  "Centaur's Herald": "{2}{G}, Sacrifice Centaur's Herald: Put a 3/3 green Centaur creature token onto the battlefield.", 
  "Worldspine Wurm": "Trample\n\nWhen Worldspine Wurm dies, put three 5/5 green Wurm creature tokens with trample onto the battlefield.\n\nWhen Worldspine Wurm is put into a graveyard from anywhere, shuffle it into its owner's library.", 
  "Jinxed Ring": "Whenever a nontoken permanent is put into your graveyard from the battlefield, Jinxed Ring deals 1 damage to you.\n\nSacrifice a creature: Target opponent gains control of Jinxed Ring. (This effect lasts indefinitely.)", 
  "Kinsbaile Borderguard": "Kinsbaile Borderguard enters the battlefield with a +1/+1 counter on it for each other Kithkin you control.\n\nWhen Kinsbaile Borderguard dies, put a 1/1 white Kithkin Soldier creature token onto the battlefield for each counter on it.", 
  "Beetleback Chief": "When Beetleback Chief enters the battlefield, put two 1/1 red Goblin creature tokens onto the battlefield.", 
  "Stonybrook Schoolmaster": "Whenever Stonybrook Schoolmaster becomes tapped, you may put a 1/1 blue Merfolk Wizard creature token onto the battlefield.", 
  "Khalni Garden": "Khalni Garden enters the battlefield tapped.\n\nWhen Khalni Garden enters the battlefield, put a 0/1 green Plant creature token onto the battlefield.\n\n{T}: Add {G} to your mana pool.", 
  "Grave Titan": "Deathtouch\n\nWhenever Grave Titan enters the battlefield or attacks, put two 2/2 black Zombie creature tokens onto the battlefield.", 
  "Howlpack Alpha": "Each other creature you control that's a Werewolf or a Wolf gets +1/+1.\n\nAt the beginning of your end step, put a 2/2 green Wolf creature token onto the battlefield.\n\nAt the beginning of each upkeep, if a player cast two or more spells last turn, transform Howlpack Alpha.", 
  "Devout Invocation": "Tap any number of untapped creatures you control. Put a 4/4 white Angel creature token with flying onto the battlefield for each creature tapped this way.", 
  "Liability": "Whenever a nontoken permanent is put into a player's graveyard from the battlefield, that player loses 1 life.", 
  "Blast from the Past": "Madness {R}, cycling {1R}, kicker {2R}, flashback {3R}, buyback {4R}\n\nBlast from the Past deals 2 damage to target creature or player.\n\nIf the kicker cost was paid, put a 1/1 red Goblin creature token into play.", 
  "Hornet Cannon": "{3}, {T}: Put a 1/1 colorless Insect artifact creature token with flying and haste named Hornet onto the battlefield. Destroy it at the beginning of the next end step.", 
  "Feed the Pack": "At the beginning of your end step, you may sacrifice a nontoken creature. If you do, put X 2/2 green Wolf creature tokens onto the battlefield, where X is the sacrificed creature's toughness.", 
  "Growing Ranks": "At the beginning of your upkeep, populate. (Put a token onto the battlefield that's a copy of a creature token you control.)", 
  "Orochi Eggwatcher": "{2}{G}, {T}: Put a 1/1 green Snake creature token onto the battlefield. If you control ten or more creatures, flip Orochi Eggwatcher.", 
  "Volrath's Laboratory": "As Volrath's Laboratory enters the battlefield, choose a color and a creature type.\n\n{5}, {T}: Put a 2/2 creature token of the chosen color and type onto the battlefield.", 
  "Pongify": "Destroy target creature. It can't be regenerated. That creature's controller puts a 3/3 green Ape creature token onto the battlefield.", 
  "Riku of Two Reflections": "Whenever you cast an instant or sorcery spell, you may pay {U}{R}. If you do, copy that spell. You may choose new targets for the copy.\n\nWhenever another nontoken creature enters the battlefield under your control, you may pay {G}{U}. If you do, put a token that's a copy of that creature onto the battlefield.", 
  "Sporogenesis": "At the beginning of your upkeep, you may put a fungus counter on target nontoken creature.\n\nWhenever a creature with a fungus counter on it dies, put a 1/1 green Saproling creature token onto the battlefield for each fungus counter on that creature.\n\nWhen Sporogenesis leaves the battlefield, remove all fungus counters from all creatures.", 
  "Stangg": "When Stangg enters the battlefield, put a legendary 3/4 red and green Human Warrior creature token named Stangg Twin onto the battlefield. When Stangg leaves the battlefield, exile that token. When that token leaves the battlefield, sacrifice Stangg.", 
  "Pact of the Titan": "Put a 4/4 red Giant creature token onto the battlefield.\n\nAt the beginning of your next upkeep, pay {4}{R}. If you don't, you lose the game.", 
  "Infested Roothold": "Defender (This creature can't attack.)\n\nProtection from artifacts\n\nWhenever an opponent casts an artifact spell, you may put a 1/1 green Insect creature token onto the battlefield.", 
  "Side to Side": "You and target opponent arm-wrestle. If you win, put a 3/3 green Ape creature token into play.", 
  "Myr Propagator": "{3}, {T}: Put a token that's a copy of Myr Propagator onto the battlefield.", 
  "Kessig Cagebreakers": "Whenever Kessig Cagebreakers attacks, put a 2/2 green Wolf creature token onto the battlefield tapped and attacking for each creature card in your graveyard.", 
  "Selesnya Guildmage": "{3}{G}: Put a 1/1 green Saproling creature token onto the battlefield.\n\n{3}{W}: Creatures you control get +1/+1 until end of turn.", 
  "Honden of Life's Web": "At the beginning of your upkeep, put a 1/1 colorless Spirit creature token onto the battlefield for each Shrine you control.", 
  "Brooding Saurian": "At the beginning of each end step, each player gains control of all nontoken permanents he or she owns.", 
  "Nantuko Shrine": "Whenever a player casts a spell, that player puts X 1/1 green Squirrel creature tokens onto the battlefield, where X is the number of cards in all graveyards with the same name as that spell.", 
  "Mausoleum Guard": "When Mausoleum Guard dies, put two 1/1 white Spirit creature tokens with flying onto the battlefield.", 
  "Elemental Mastery": "Enchant creature\n\nEnchanted creature has \"{T}: Put X 1/1 red Elemental creature tokens with haste onto the battlefield, where X is this creature's power. Exile them at the beginning of the next end step.\"", 
  "Sengir Autocrat": "When Sengir Autocrat enters the battlefield, put three 0/1 black Serf creature tokens onto the battlefield.\n\nWhen Sengir Autocrat leaves the battlefield, exile all Serf tokens.", 
  "Spike Breeder": "Spike Breeder enters the battlefield with three +1/+1 counters on it.\n\n{2}, Remove a +1/+1 counter from Spike Breeder: Put a +1/+1 counter on target creature.\n\n{2}, Remove a +1/+1 counter from Spike Breeder: Put a 1/1 green Spike creature token onto the battlefield.", 
  "Selesnya Evangel": "{1}, {T}, Tap an untapped creature you control: Put a 1/1 green Saproling creature token onto the battlefield.", 
  "Tatsumasa, the Dragon's Fang": "Equipped creature gets +5/+5.\n\n{6}, Exile Tatsumasa, the Dragon's Fang: Put a 5/5 blue Dragon Spirit creature token with flying onto the battlefield. Return Tatsumasa to the battlefield under its owner's control when that token dies.\n\nEquip {3}", 
  "Skirk Ridge Exhumer": "{B}, {T}, Discard a card: Put a 1/1 black Zombie Goblin creature token named Festering Goblin onto the battlefield. It has \"When Festering Goblin dies, target creature gets -1/-1 until end of turn.\"", 
  "Terastodon": "When Terastodon enters the battlefield, you may destroy up to three target noncreature permanents. For each permanent put into a graveyard this way, its controller puts a 3/3 green Elephant creature token onto the battlefield.", 
  "Monkey Cage": "When a creature enters the battlefield, sacrifice Monkey Cage and put X 2/2 green Ape creature tokens onto the battlefield, where X is that creature's converted mana cost.", 
  "Varchild's War-Riders": "Cumulative upkeep—Have an opponent put a 1/1 red Survivor creature token onto the battlefield. (At the beginning of your upkeep, put an age counter on this permanent, then sacrifice it unless you pay its upkeep cost for each age counter on it.)\n\nTrample; rampage 1 (Whenever this creature becomes blocked, it gets +1/+1 until end of turn for each creature blocking it beyond the first.)", 
  "Drudge Spell": "{B}, Exile two creature cards from your graveyard: Put a 1/1 black Skeleton creature token onto the battlefield. It has \"{B}: Regenerate this creature.\"\n\nWhen Drudge Spell leaves the battlefield, destroy all Skeleton tokens. They can't be regenerated.", 
  "Golem Foundry": "Whenever you cast an artifact spell, you may put a charge counter on Golem Foundry.\n\nRemove three charge counters from Golem Foundry: Put a 3/3 colorless Golem artifact creature token onto the battlefield.", 
  "Goblin Scouts": "Put three 1/1 red Goblin Scout creature tokens with mountainwalk onto the battlefield.", 
  "Crush of Wurms": "Put three 6/6 green Wurm creature tokens onto the battlefield.\n\nFlashback {9}{G}{G}{G} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", 
  "Requiem Angel": "Flying\n\nWhenever another non-Spirit creature you control dies, put a 1/1 white Spirit creature token with flying onto the battlefield.", 
  "Transluminant": "{W}, Sacrifice Transluminant: Put a 1/1 white Spirit creature token with flying onto the battlefield at the beginning of the next end step.", 
  "Army of the Damned": "Put thirteen 2/2 black Zombie creature tokens onto the battlefield tapped.\n\nFlashback {7}{B}{B}{B} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", 
  "Unscythe, Killer of Kings": "Equipped creature gets +3/+3 and has first strike.\n\nWhenever a creature dealt damage by equipped creature this turn dies, you may exile that card. If you do, put a 2/2 black Zombie creature token onto the battlefield.\n\nEquip {2}", 
  "Waylay": "Put three 2/2 white Knight creature tokens onto the battlefield. Exile them at the beginning of the next cleanup step.", 
  "Living Hive": "Trample\n\nWhenever Living Hive deals combat damage to a player, put that many 1/1 green Insect creature tokens onto the battlefield.", 
  "Teferi's Realm": "At the beginning of each player's upkeep, that player chooses artifact, creature, land, or non-Aura enchantment. All nontoken permanents of that type phase out. (While they're phased out, they're treated as though they don't exist. Each one phases in before its controller untaps during his or her next untap step.)", 
  "Roar of the Wurm": "Put a 6/6 green Wurm creature token onto the battlefield.\n\nFlashback {3}{G} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", 
  "Séance": "At the beginning of each upkeep, you may exile target creature card from your graveyard. If you do, put a token onto the battlefield that's a copy of that card except it's a Spirit in addition to its other types. Exile it at the beginning of the next end step.", 
  "Mycoloth": "Devour 2 (As this enters the battlefield, you may sacrifice any number of creatures. This creature enters the battlefield with twice that many +1/+1 counters on it.)\n\nAt the beginning of your upkeep, put a 1/1 green Saproling creature token onto the battlefield for each +1/+1 counter on Mycoloth.", 
  "Captain of the Watch": "Vigilance (Attacking doesn't cause this creature to tap.)\n\nOther Soldier creatures you control get +1/+1 and have vigilance.\n\nWhen Captain of the Watch enters the battlefield, put three 1/1 white Soldier creature tokens onto the battlefield.", 
  "Heat Shimmer": "Put a token that's a copy of target creature onto the battlefield. That token has haste and \"At the beginning of the end step, exile this permanent.\"", 
  "Feudkiller's Verdict": "You gain 10 life. Then if you have more life than an opponent, put a 5/5 white Giant Warrior creature token onto the battlefield.", 
  "XXCall of the Herd (Call of the Herd)": "Put a 3/3 green Elephant creature token onto the battlefield.\n\nFlashback {3}{G} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", 
  "Gather the Townsfolk": "Put two 1/1 white Human creature tokens onto the battlefield.\n\nFateful hour — If you have 5 or less life, put five of those tokens onto the battlefield instead.", 
  "Security Blockade": "Enchant land\n\nWhen Security Blockade enters the battlefield, put a 2/2 white Knight creature token with vigilance onto the battlefield.\n\nEnchanted land has \"{T}: Prevent the next 1 damage that would be dealt to you this turn.\"", 
  "Goblin Offensive": "Put X 1/1 red Goblin creature tokens onto the battlefield.", 
  "Leafdrake Roost": "Enchant land\n\nEnchanted land has \"{G}{U}, {T}: Put a 2/2 green and blue Drake creature token with flying onto the battlefield.\"", 
  "Isle of Vesuva": "Whenever a nontoken creature enters the battlefield, its controller puts a token onto the battlefield that's a copy of that creature.\n\nWhenever you roll {C}, destroy target creature and all other creatures with the same name as that creature.", 
  "Feral Lightning": "Put three 3/1 red Elemental creature tokens with haste onto the battlefield. Exile them at the beginning of the next end step.", 
  "Pallid Mycoderm": "At the beginning of your upkeep, put a spore counter on Pallid Mycoderm.\n\nRemove three spore counters from Pallid Mycoderm: Put a 1/1 green Saproling creature token onto the battlefield.\n\nSacrifice a Saproling: Each creature you control that's a Fungus or a Saproling gets +1/+1 until end of turn.", 
  "Bringer of the Green Dawn": "You may pay {W}{U}{B}{R}{G} rather than pay Bringer of the Green Dawn's mana cost.\n\nTrample\n\nAt the beginning of your upkeep, you may put a 3/3 green Beast creature token onto the battlefield.", 
  "Saproling Symbiosis": "You may cast Saproling Symbiosis any time you could cast an instant if you pay {2} more to cast it.\n\nPut a 1/1 green Saproling creature token onto the battlefield for each creature you control.", 
  "Skeletal Vampire": "Flying\n\nWhen Skeletal Vampire enters the battlefield, put two 1/1 black Bat creature tokens with flying onto the battlefield.\n\n{3}{B}{B}, Sacrifice a Bat: Put two 1/1 black Bat creature tokens with flying onto the battlefield.\n\nSacrifice a Bat: Regenerate Skeletal Vampire.", 
  "Flurry of Wings": "Put X 1/1 white Bird Soldier creature tokens with flying onto the battlefield, where X is the number of attacking creatures.", 
  "Wayfaring Temple": "Wayfaring Temple's power and toughness are each equal to the number of creatures you control.\n\nWhenever Wayfaring Temple deals combat damage to a player, populate. (Put a token onto the battlefield that's a copy of a creature token you control.)", 
  "Heliod, God of the Sun": "Indestructible\n\nAs long as your devotion to white is less than five, Heliod isn't a creature. (Each {W} in the mana costs of permanents you control counts toward your devotion to white.)\n\nOther creatures you control have vigilance.\n\n{2}{W}{W}: Put a 2/1 white Cleric enchantment creature token onto the battlefield.", 
  "Baru, Fist of Krosa": "Whenever a Forest enters the battlefield, green creatures you control get +1/+1 and gain trample until end of turn.\n\nGrandeur — Discard another card named Baru, Fist of Krosa: Put an X/X green Wurm creature token onto the battlefield, where X is the number of lands you control.", 
  "Tolsimir Wolfblood": "Other green creatures you control get +1/+1.\n\nOther white creatures you control get +1/+1.\n\n{T}: Put a legendary 2/2 green and white Wolf creature token named Voja onto the battlefield.", 
  "Rapacious One": "Trample\n\nWhenever Rapacious One deals combat damage to a player, put that many 0/1 colorless Eldrazi Spawn creature tokens onto the battlefield. They have \"Sacrifice this creature: Add {1} to your mana pool.\"", 
  "Elephant Guide": "Enchant creature\n\nEnchanted creature gets +3/+3.\n\nWhen enchanted creature dies, put a 3/3 green Elephant creature token onto the battlefield.", 
  "Skirsdag High Priest": "Morbid — {T}, Tap two untapped creatures you control: Put a 5/5 black Demon creature token with flying onto the battlefield. Activate this ability only if a creature died this turn.", 
  "Spawnwrithe": "Trample\n\nWhenever Spawnwrithe deals combat damage to a player, put a token that's a copy of Spawnwrithe onto the battlefield.", 
  "Kresh the Bloodbraided Avatar": "Whenever a creature you control is devoured, put an X/X green Ooze creature token onto the battlefield, where X is the devoured creature's power.", 
  "Phelddagrif": "{G}: Phelddagrif gains trample until end of turn. Target opponent puts a 1/1 green Hippo creature token onto the battlefield.\n\n{W}: Phelddagrif gains flying until end of turn. Target opponent gains 2 life.\n\n{U}: Return Phelddagrif to its owner's hand. Target opponent may draw a card.", 
  "Evil Comes to Fruition": "When you set this scheme in motion, put seven 0/1 green Plant creature tokens onto the battlefield. If you control ten or more lands, put seven 3/3 green Elemental creature tokens onto the battlefield instead.", 
  "Trostani, Selesnya's Voice": "Whenever another creature enters the battlefield under your control, you gain life equal to that creature's toughness.\n\n{1}{G}{W}, {T}: Populate. (Put a token onto the battlefield that's a copy of a creature token you control.)", 
  "Ignite the Cloneforge!": "When you set this scheme in motion, put a token onto the battlefield that's a copy of target permanent an opponent controls.", 
  "Knight Watch": "Put two 2/2 white Knight creature tokens with vigilance onto the battlefield.", 
  "Greener Pastures": "At the beginning of each player's upkeep, if that player controls more lands than each other player, the player puts a 1/1 green Saproling creature token onto the battlefield.", 
  "Hostility": "Haste\n\nIf a spell you control would deal damage to an opponent, prevent that damage. Put a 3/1 red Elemental Shaman creature token with haste onto the battlefield for each 1 damage prevented this way.\n\nWhen Hostility is put into a graveyard from anywhere, shuffle it into its owner's library.", 
  "Meloku the Clouded Mirror": "Flying\n\n{1}, Return a land you control to its owner's hand: Put a 1/1 blue Illusion creature token with flying onto the battlefield.", 
  "Dark Depths": "Dark Depths enters the battlefield with ten ice counters on it.\n\n{3}: Remove an ice counter from Dark Depths.\n\nWhen Dark Depths has no ice counters on it, sacrifice it. If you do, put a legendary 20/20 black Avatar creature token with flying and indestructible named Marit Lage onto the battlefield.", 
  "Pollenbright Wings": "Enchant creature\n\nEnchanted creature has flying.\n\nWhenever enchanted creature deals combat damage to a player, put that many 1/1 green Saproling creature tokens onto the battlefield.", 
  "Advent of the Wurm": "Put a 5/5 green Wurm creature token with trample onto the battlefield.", 
  "Elspeth, Knight-Errant": "+1: Put a 1/1 white Soldier creature token onto the battlefield.\n\n+1: Target creature gets +3/+3 and gains flying until end of turn.\n\n-8: You get an emblem with \"Artifacts, creatures, enchantments, and lands you control have indestructible.\"", 
  "Assemble the Legion": "At the beginning of your upkeep, put a muster counter on Assemble the Legion. Then put a 1/1 red and white Soldier creature token with haste onto the battlefield for each muster counter on Assemble the Legion.", 
  "Sekki, Seasons' Guide": "Sekki, Seasons' Guide enters the battlefield with eight +1/+1 counters on it.\n\nIf damage would be dealt to Sekki, prevent that damage, remove that many +1/+1 counters from Sekki, and put that many 1/1 colorless Spirit creature tokens onto the battlefield.\n\nSacrifice eight Spirits: Return Sekki from your graveyard to the battlefield.", 
  "Presence of Gond": "Enchant creature\n\nEnchanted creature has \"{T}: Put a 1/1 green Elf Warrior creature token onto the battlefield.\"", 
  "Wolfbriar Elemental": "Multikicker {G} (You may pay an additional {G} any number of times as you cast this spell.)\n\nWhen Wolfbriar Elemental enters the battlefield, put a 2/2 green Wolf creature token onto the battlefield for each time it was kicked.", 
  "Ambassador Oak": "When Ambassador Oak enters the battlefield, put a 1/1 green Elf Warrior creature token onto the battlefield.", 
  "Firecat Blitz": "Put X 1/1 red Elemental Cat creature tokens with haste onto the battlefield. Exile them at the beginning of the next end step.\n\nFlashback—{R}{R}, Sacrifice X Mountains. (You may cast this card from your graveyard for its flashback cost. Then exile it.)", 
  "Maalfeld Twins": "When Maalfeld Twins dies, put two 2/2 black Zombie creature tokens onto the battlefield.", 
  "Rise of the Hobgoblins": "When Rise of the Hobgoblins enters the battlefield, you may pay {X}. If you do, put X 1/1 red and white Goblin Soldier creature tokens onto the battlefield.\n\n{R/W}: Red creatures and white creatures you control gain first strike until end of turn.", 
  "Spontaneous Generation": "Put a 1/1 green Saproling creature token onto the battlefield for each card in your hand.", 
  "Dovescape": "({W/U} can be paid with either {W} or {U}.)\n\nWhenever a player casts a noncreature spell, counter that spell. That player puts X 1/1 white and blue Bird creature tokens with flying onto the battlefield, where X is the spell's converted mana cost.", 
  "Bant Sojourners": "When you cycle Bant Sojourners or it dies, you may put a 1/1 white Soldier creature token onto the battlefield.\n\nCycling {2}{W} ({2}{W}, Discard this card: Draw a card.)", 
  "Sporesower Thallid": "At the beginning of your upkeep, put a spore counter on each Fungus you control.\n\nRemove three spore counters from Sporesower Thallid: Put a 1/1 green Saproling creature token onto the battlefield.", 
  "Master Splicer": "When Master Splicer enters the battlefield, put a 3/3 colorless Golem artifact creature token onto the battlefield.\n\nGolem creatures you control get +1/+1.", 
  "Snake Basket": "{X}, Sacrifice Snake Basket: Put X 1/1 green Snake creature tokens onto the battlefield. Activate this ability only any time you could cast a sorcery.", 
  "Death by Dragons": "Each player other than target player puts a 5/5 red Dragon creature token with flying onto the battlefield.", 
  "Predatory Advantage": "At the beginning of each opponent's end step, if that player didn't cast a creature spell this turn, put a 2/2 green Lizard creature token onto the battlefield.", 
  "Conqueror's Pledge": "Kicker {6} (You may pay an additional {6} as you cast this spell.)\n\nPut six 1/1 white Kor Soldier creature tokens onto the battlefield. If Conqueror's Pledge was kicked, put twelve of those tokens onto the battlefield instead.", 
  "Penumbra Kavu": "When Penumbra Kavu dies, put a 3/3 black Kavu creature token onto the battlefield.", 
  "Chatter of the Squirrel": "Put a 1/1 green Squirrel creature token onto the battlefield.\n\nFlashback {1}{G} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", 
  "Origin Spellbomb": "{1}, {T}, Sacrifice Origin Spellbomb: Put a 1/1 colorless Myr artifact creature token onto the battlefield.\n\nWhen Origin Spellbomb is put into a graveyard from the battlefield, you may pay {W}. If you do, draw a card.", 
  "Jötun Owl Keeper": "Cumulative upkeep {W} or {U} (At the beginning of your upkeep, put an age counter on this permanent, then sacrifice it unless you pay its upkeep cost for each age counter on it.)\n\nWhen Jötun Owl Keeper dies, put a 1/1 white Bird creature token with flying onto the battlefield for each age counter on it.", 
  "Fists of Ironwood": "Enchant creature\n\nWhen Fists of Ironwood enters the battlefield, put two 1/1 green Saproling creature tokens onto the battlefield.\n\nEnchanted creature has trample.", 
  "Armada Wurm": "Trample\n\nWhen Armada Wurm enters the battlefield, put a 5/5 green Wurm creature token with trample onto the battlefield.", 
  "Mirror-Sigil Sergeant": "Trample\n\nAt the beginning of your upkeep, if you control a blue permanent, you may put a token that's a copy of Mirror-Sigil Sergeant onto the battlefield.", 
  "Battle Screech": "Put two 1/1 white Bird creature tokens with flying onto the battlefield.\n\nFlashback—Tap three untapped white creatures you control. (You may cast this card from your graveyard for its flashback cost. Then exile it.)", 
  "Rakdos Guildmage": "({B/R} can be paid with either {B} or {R}.)\n\n{3}{B}, Discard a card: Target creature gets -2/-2 until end of turn.\n\n{3}{R}: Put a 2/1 red Goblin creature token with haste onto the battlefield. Exile it at the beginning of the next end step.", 
  "Sparkspitter": "{R}, {T}, Discard a card: Put a 3/1 red Elemental creature token named Spark Elemental onto the battlefield. It has trample, haste, and \"At the beginning of the end step, sacrifice Spark Elemental.\"", 
  "Icatian Crier": "{1}{W}, {T}, Discard a card: Put two 1/1 white Citizen creature tokens onto the battlefield.", 
  "Midnight Haunting": "Put two 1/1 white Spirit creature tokens with flying onto the battlefield.", 
  "Lair of the Ashen Idol": "At the beginning of your upkeep, sacrifice a creature. If you can't, planeswalk.\n\nWhenever you roll chaos, any number of target players each put a 2/2 black Zombie creature token onto the battlefield.", 
  "Grinning Demon Avatar": "Whenever a nontoken creature you control dies, target opponent discards a card.", 
  "Errand of Duty": "Put a 1/1 white Knight creature token with banding onto the battlefield. (Any creatures with banding, and up to one without, can attack in a band. Bands are blocked as a group. If any creatures with banding you control are blocking or being blocked by a creature, you divide that creature's combat damage, not its controller, among any of the creatures it's being blocked by or is blocking.)", 
  "Saproling Burst": "Fading 7 (This enchantment enters the battlefield with seven fade counters on it. At the beginning of your upkeep, remove a fade counter from it. If you can't, sacrifice it.)\n\nRemove a fade counter from Saproling Burst: Put a green Saproling creature token onto the battlefield. It has \"This creature's power and toughness are each equal to the number of fade counters on Saproling Burst.\"\n\nWhen Saproling Burst leaves the battlefield, destroy all tokens put onto the battlefield with Saproling Burst. They can't be regenerated.", 
  "Vraska the Unseen": "+1: Until your next turn, whenever a creature deals combat damage to Vraska the Unseen, destroy that creature.\n\n-3: Destroy target nonland permanent.\n\n-7: Put three 1/1 black Assassin creature tokens onto the battlefield with \"Whenever this creature deals combat damage to a player, that player loses the game.\"", 
  "Erhnam Djinn Avatar": "Whenever you cast a creature spell, put a 1/1 green Saproling creature token onto the battlefield.", 
  "Trostani's Summoner": "When Trostani's Summoner enters the battlefield, put a 2/2 white Knight creature token with vigilance, a 3/3 green Centaur creature token, and a 4/4 green Rhino creature token with trample onto the battlefield.", 
  "Ajani Goldmane": "+1: You gain 2 life.\n\n-1: Put a +1/+1 counter on each creature you control. Those creatures gain vigilance until end of turn.\n\n-6: Put a white Avatar creature token onto the battlefield. It has \"This creature's power and toughness are each equal to your life total.\"", 
  "Plague of Vermin": "Starting with you, each player may pay any amount of life. Repeat this process until no one pays life. Each player puts a 1/1 black Rat creature token onto the battlefield for each 1 life he or she paid this way.", 
  "Demonic Rising": "At the beginning of your end step, if you control exactly one creature, put a 5/5 black Demon creature token with flying onto the battlefield.", 
  "Ivory Guardians": "Protection from red\n\nCreatures named Ivory Guardians get +1/+1 as long as an opponent controls a nontoken red permanent.", 
  "Saproling Cluster": "{1}, Discard a card: Put a 1/1 green Saproling creature token onto the battlefield. Any player may activate this ability.", 
  "Evangel of Heliod": "When Evangel of Heliod enters the battlefield, put a number of 1/1 white Soldier creature tokens onto the battlefield equal to your devotion to white. (Each {W} in the mana costs of permanents you control counts toward your devotion to white.)", 
  "Savage Conception": "Put a 3/3 green Beast creature token onto the battlefield.\n\nRetrace (You may cast this card from your graveyard by discarding a land card in addition to paying its other costs.)", 
  "Ghave, Guru of Spores": "Ghave, Guru of Spores enters the battlefield with five +1/+1 counters on it.\n\n{1}, Remove a +1/+1 counter from a creature you control: Put a 1/1 green Saproling creature token onto the battlefield.\n\n{1}, Sacrifice a creature: Put a +1/+1 counter on target creature.", 
  "Pegasus Refuge": "{2}, Discard a card: Put a 1/1 white Pegasus creature token with flying onto the battlefield.", 
  "Thelonite Hermit": "Saproling creatures get +1/+1.\n\nMorph {3}{G}{G} (You may cast this face down as a 2/2 creature for {3}. Turn it face up any time for its morph cost.)\n\nWhen Thelonite Hermit is turned face up, put four 1/1 green Saproling creature tokens onto the battlefield.", 
  "Attended Knight": "First strike (This creature deals combat damage before creatures without first strike.)\n\nWhen Attended Knight enters the battlefield, put a 1/1 white Soldier creature token onto the battlefield.", 
  "Eyes in the Skies": "Put a 1/1 white Bird creature token with flying onto the battlefield, then populate. (Put a token onto the battlefield that's a copy of a creature token you control.)", 
  "Gallows at Willow Hill": "{3}, {T}, Tap three untapped Humans you control: Destroy target creature. Its controller puts a 1/1 white Spirit creature token with flying onto the battlefield.", 
  "Turntimber Ranger": "Whenever Turntimber Ranger or another Ally enters the battlefield under your control, you may put a 2/2 green Wolf creature token onto the battlefield. If you do, put a +1/+1 counter on Turntimber Ranger.", 
  "Field of Souls": "Whenever a nontoken creature is put into your graveyard from the battlefield, put a 1/1 white Spirit creature token with flying onto the battlefield.", 
  "Precinct Captain": "First strike\n\nWhenever Precinct Captain deals combat damage to a player, put a 1/1 white Soldier creature token onto the battlefield.", 
  "Maul Splicer": "When Maul Splicer enters the battlefield, put two 3/3 colorless Golem artifact creature tokens onto the battlefield.\n\nGolem creatures you control have trample.", 
  "Lord of Lineage": "Flying\n\nOther Vampire creatures you control get +2/+2.\n\n{T}: Put a 2/2 black Vampire creature token with flying onto the battlefield.", 
  "Necropouncer": "Living weapon (When this Equipment enters the battlefield, put a 0/0 black Germ creature token onto the battlefield, then attach this to it.)\n\nEquipped creature gets +3/+1 and has haste.\n\nEquip {2}", 
  "Din of the Fireherd": "Put a 5/5 black and red Elemental creature token onto the battlefield. Target opponent sacrifices a creature for each black creature you control, then sacrifices a land for each red creature you control.", 
  "Vile Rebirth": "Exile target creature card from a graveyard. Put a 2/2 black Zombie creature token onto the battlefield.", 
  "Repel Intruders": "Put two 1/1 white Kithkin Soldier creature tokens onto the battlefield if {W} was spent to cast Repel Intruders. Counter up to one target creature spell if {U} was spent to cast Repel Intruders. (Do both if {W}{U} was spent.)", 
  "Æther Mutation": "Return target creature to its owner's hand. Put X 1/1 green Saproling creature tokens onto the battlefield, where X is that creature's converted mana cost.", 
  "Awakening Zone": "At the beginning of your upkeep, you may put a 0/1 colorless Eldrazi Spawn creature token onto the battlefield. It has \"Sacrifice this creature: Add {1} to your mana pool.\"", 
  "Midnight Ritual": "Exile X target creature cards from your graveyard. For each creature card exiled this way, put a 2/2 black Zombie creature token onto the battlefield.", 
  "Roc Egg": "Defender (This creature can't attack.)\n\nWhen Roc Egg dies, put a 3/3 white Bird creature token with flying onto the battlefield.", 
  "Elvish Farmer": "At the beginning of your upkeep, put a spore counter on Elvish Farmer.\n\nRemove three spore counters from Elvish Farmer: Put a 1/1 green Saproling creature token onto the battlefield.\n\nSacrifice a Saproling: You gain 2 life.", 
  "Throne of Empires": "{1}, {T}: Put a 1/1 white Soldier creature token onto the battlefield. Put five of those tokens onto the battlefield instead if you control artifacts named Crown of Empires and Scepter of Empires.", 
  "Gargoyle Castle": "{T}: Add {1} to your mana pool.\n\n{5}, {T}, Sacrifice Gargoyle Castle: Put a 3/4 colorless Gargoyle artifact creature token with flying onto the battlefield.", 
  "Ajani's Chosen": "Whenever an enchantment enters the battlefield under your control, put a 2/2 white Cat creature token onto the battlefield. If that enchantment is an Aura, you may attach it to the token.", 
  "Sliversmith": "{1}, {T}, Discard a card: Put a 1/1 colorless Sliver artifact creature token named Metallic Sliver onto the battlefield.", 
  "Batterskull": "Living weapon (When this Equipment enters the battlefield, put a 0/0 black Germ creature token onto the battlefield, then attach this to it.)\n\nEquipped creature gets +4/+4 and has vigilance and lifelink.\n\n{3}: Return Batterskull to its owner's hand.\n\nEquip {5}", 
  "Jihad": "As Jihad enters the battlefield, choose a color and an opponent.\n\nWhite creatures get +2/+1 as long as the chosen player controls a nontoken permanent of the chosen color.\n\nWhen the chosen player controls no nontoken permanents of the chosen color, sacrifice Jihad.", 
  "Militia's Pride": "Whenever a nontoken creature you control attacks, you may pay {W}. If you do, put a 1/1 white Kithkin Soldier creature token onto the battlefield tapped and attacking.", 
  "Pawn of Ulamog": "Whenever Pawn of Ulamog or another nontoken creature you control dies, you may put a 0/1 colorless Eldrazi Spawn creature token onto the battlefield. It has \"Sacrifice this creature: Add {1} to your mana pool.\"", 
  "Kher Keep": "{T}: Add {1} to your mana pool.\n\n{1}{R}, {T}: Put a 0/1 red Kobold creature token named Kobolds of Kher Keep onto the battlefield.", 
  "Tempt with Vengeance": "Tempting offer — Put X 1/1 red Elemental creature tokens with haste onto the battlefield. Each opponent may put X 1/1 red Elemental creature tokens with haste onto the battlefield. For each player who does, put X 1/1 red Elemental creature tokens with haste onto the battlefield.", 
  "Cellar Door": "{3}, {T}: Target player puts the bottom card of his or her library into his or her graveyard. If it's a creature card, you put a 2/2 black Zombie creature token onto the battlefield.", 
  "Hearthcage Giant": "When Hearthcage Giant enters the battlefield, put two 3/1 red Elemental Shaman creature tokens onto the battlefield.\n\nSacrifice an Elemental: Target Giant creature gets +3/+1 until end of turn.", 
  "Imperial Mask": "When Imperial Mask enters the battlefield, if it's not a token, each of your teammates puts a token that's a copy of Imperial Mask onto the battlefield.\n\nYou have hexproof. (You can't be the target of spells or abilities your opponents control.)", 
  "Angelic Favor": "If you control a Plains, you may tap an untapped creature you control rather than pay Angelic Favor's mana cost.\n\nCast Angelic Favor only during combat.\n\nPut a 4/4 white Angel creature token with flying onto the battlefield. Exile it at the beginning of the next end step.", 
  "Elspeth Tirel": "+2: You gain 1 life for each creature you control.\n\n-2: Put three 1/1 white Soldier creature tokens onto the battlefield.\n\n-5: Destroy all other permanents except for lands and tokens.", 
  "Spore Burst": "Domain — Put a 1/1 green Saproling creature token onto the battlefield for each basic land type among lands you control.", 
  "Hunted Dragon": "Flying, haste\n\nWhen Hunted Dragon enters the battlefield, target opponent puts three 2/2 white Knight creature tokens with first strike onto the battlefield.", 
  "Centaur Glade": "{2}{G}{G}: Put a 3/3 green Centaur creature token onto the battlefield.", 
  "Zombie Infestation": "Discard two cards: Put a 2/2 black Zombie creature token onto the battlefield.", 
  "Mitotic Slime": "When Mitotic Slime dies, put two 2/2 green Ooze creature tokens onto the battlefield. They have \"When this creature dies, put two 1/1 green Ooze creature tokens onto the battlefield.\"", 
  "Rishadan Pawnshop": "{2}, {T}: Shuffle target nontoken permanent you control into its owner's library.", 
  "Vitality Charm": "Choose one — Put a 1/1 green Insect creature token onto the battlefield; or target creature gets +1/+1 and gains trample until end of turn; or regenerate target Beast.", 
  "Wakedancer": "Morbid — When Wakedancer enters the battlefield, if a creature died this turn, put a 2/2 black Zombie creature token onto the battlefield.", 
  "Kiki-Jiki, Mirror Breaker": "Haste\n\n{T}: Put a token that's a copy of target nonlegendary creature you control onto the battlefield. That token has haste. Sacrifice it at the beginning of the next end step.", 
  "Kathari Bomber": "Flying\n\nWhen Kathari Bomber deals combat damage to a player, put two 1/1 red Goblin creature tokens onto the battlefield and sacrifice Kathari Bomber.\n\nUnearth {3}{B}{R} ({3}{B}{R}: Return this card from your graveyard to the battlefield. It gains haste. Exile it at the beginning of the next end step or if it would leave the battlefield. Unearth only as a sorcery.)", 
  "Balduvian Dead": "{2}{R}, Exile a creature card from your graveyard: Put a 3/1 black and red Graveborn creature token with haste onto the battlefield. Sacrifice it at the beginning of the next end step.", 
  "Oona, Queen of the Fae": "Flying\n\n{X}{U/B}: Choose a color. Target opponent exiles the top X cards of his or her library. For each card of the chosen color exiled this way, put a 1/1 blue and black Faerie Rogue creature token with flying onto the battlefield.", 
  "Chronozoa": "Flying\n\nVanishing 3 (This permanent enters the battlefield with three time counters on it. At the beginning of your upkeep, remove a time counter from it. When the last is removed, sacrifice it.)\n\nWhen Chronozoa dies, if it had no time counters on it, put two tokens that are copies of it onto the battlefield.", 
  "The Iron Guardian Stirs": "When you set this scheme in motion, put a 4/6 colorless Golem artifact creature token onto the battlefield.", 
  "Maelstrom Archangel Avatar": "At end of combat, for each creature you controlled at the time it dealt combat damage to a player this turn, copy a random card with the same mana cost as that creature. You may pay {3}. If you do, choose one of those copies. If a copy of a permanent card is chosen, you may put a token onto the battlefield that's a copy of that card. If a copy of an instant or sorcery card is chosen, you may cast the copy without paying its mana cost.", 
  "Grizzly Fate": "Put two 2/2 green Bear creature tokens onto the battlefield.\n\nThreshold — Put four 2/2 green Bear creature tokens onto the battlefield instead if seven or more cards are in your graveyard.\n\nFlashback {5}{G}{G} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", 
  "Flock of Rabid Sheep": "Flip X coins; an opponent calls heads or tails. For each flip you win, put a Rabid Sheep token into play. Treat these tokens as 2/2 green creatures that count as Sheep.", 
  "Archdemon of Unx": "Flying, trample\n\nAt the beginning of your upkeep, sacrifice a non-Zombie creature, then put a 2/2 black Zombie creature token onto the battlefield.", 
  "Elvish Promenade": "Put a 1/1 green Elf Warrior creature token onto the battlefield for each Elf you control.", 
  "Griffin Guide": "Enchant creature\n\nEnchanted creature gets +2/+2 and has flying.\n\nWhen enchanted creature dies, put a 2/2 white Griffin creature token with flying onto the battlefield.", 
  "Spiritual Visit": "Put a 1/1 colorless Spirit creature token onto the battlefield.\n\nSplice onto Arcane {W} (As you cast an Arcane spell, you may reveal this card from your hand and pay its splice cost. If you do, add this card's effects to that spell.)", 
  "Bloodline Keeper": "Flying\n\n{T}: Put a 2/2 black Vampire creature token with flying onto the battlefield.\n\n{B}: Transform Bloodline Keeper. Activate this ability only if you control five or more Vampires.", 
  "Tuktuk the Explorer": "Haste\n\nWhen Tuktuk the Explorer dies, put a legendary 5/5 colorless Goblin Golem artifact creature token named Tuktuk the Returned onto the battlefield.", 
  "Weirding Shaman": "{3}{B}, Sacrifice a Goblin: Put two 1/1 black Goblin Rogue creature tokens onto the battlefield.", 
  "Water Gun Balloon Game": "As Water Gun Balloon Game comes into play, each player puts a pop counter on a 0.\n\nWhenever a player plays a spell, move that player's pop counter up 1.\n\nWhenever a player's pop counter hits 5, that player puts a 5/5 pink Giant Teddy Bear creature token into play and resets all pop counters to 0.", 
  "Llanowar Mentor": "{G}, {T}, Discard a card: Put a 1/1 green Elf Druid creature token named Llanowar Elves onto the battlefield. It has \"{T}: Add {G} to your mana pool.\"", 
  "Hunting Pack": "Put a 4/4 green Beast creature token onto the battlefield.\n\nStorm (When you cast this spell, copy it for each spell cast before it this turn.)", 
  "Night Soil": "{1}, Exile two creature cards from a single graveyard: Put a 1/1 green Saproling creature token onto the battlefield.", 
  "Quest for the Gravelord": "Whenever a creature dies, you may put a quest counter on Quest for the Gravelord.\n\nRemove three quest counters from Quest for the Gravelord and sacrifice it: Put a 5/5 black Zombie Giant creature token onto the battlefield.", 
  "Symbiotic Beast": "When Symbiotic Beast dies, put four 1/1 green Insect creature tokens onto the battlefield.", 
  "Pack Rat": "Pack Rat's power and toughness are each equal to the number of Rats you control.\n\n{2}{B}, Discard a card: Put a token onto the battlefield that's a copy of Pack Rat.", 
  "Hellion Eruption": "Sacrifice all creatures you control, then put that many 4/4 red Hellion creature tokens onto the battlefield.", 
  "Duplicant": "Imprint — When Duplicant enters the battlefield, you may exile target nontoken creature.\n\nAs long as a card exiled with Duplicant is a creature card, Duplicant has the power, toughness, and creature types of the last creature card exiled with Duplicant. It's still a Shapeshifter.", 
  "Vitu-Ghazi, the City-Tree": "{T}: Add {1} to your mana pool.\n\n{2}{G}{W}, {T}: Put a 1/1 green Saproling creature token onto the battlefield.", 
  "Bitterblossom": "At the beginning of your upkeep, you lose 1 life and put a 1/1 black Faerie Rogue creature token with flying onto the battlefield.", 
  "Rampaging Baloths": "Trample\n\nLandfall — Whenever a land enters the battlefield under your control, you may put a 4/4 green Beast creature token onto the battlefield.", 
  "Giantbaiting": "Put a 4/4 red and green Giant Warrior creature token with haste onto the battlefield. Exile it at the beginning of the next end step.\n\nConspire (As you cast this spell, you may tap two untapped creatures you control that share a color with it. When you do, copy it.)", 
  "Skittering Invasion": "Put five 0/1 colorless Eldrazi Spawn creature tokens onto the battlefield. They have \"Sacrifice this creature: Add {1} to your mana pool.\"", 
  "Nature Shields Its Own": "(An ongoing scheme remains face up until it's abandoned.)\n\nWhenever a creature attacks and isn't blocked, if you're the defending player, put a 0/1 green Plant creature token onto the battlefield blocking that creature.\n\nWhen four or more creatures attack you, abandon this scheme at end of combat.", 
  "Thopter Squadron": "Flying\n\nThopter Squadron enters the battlefield with three +1/+1 counters on it.\n\n{1}, Remove a +1/+1 counter from Thopter Squadron: Put a 1/1 colorless Thopter artifact creature token with flying onto the battlefield. Activate this ability only any time you could cast a sorcery.\n\n{1}, Sacrifice another Thopter: Put a +1/+1 counter on Thopter Squadron. Activate this ability only any time you could cast a sorcery.", 
  "Beacon of Creation": "Put a 1/1 green Insect creature token onto the battlefield for each Forest you control. Shuffle Beacon of Creation into its owner's library.", 
  "Necromancer's Covenant": "When Necromancer's Covenant enters the battlefield, exile all creature cards from target player's graveyard, then put a 2/2 black Zombie creature token onto the battlefield for each card exiled this way.\n\nZombies you control have lifelink.", 
  "Gemini Engine": "Whenever Gemini Engine attacks, put a colorless Construct artifact creature token named Twin onto the battlefield attacking. Its power is equal to Gemini Engine's power and its toughness is equal to Gemini Engine's toughness. Sacrifice the token at end of combat.", 
  "Gutter Grime": "Whenever a nontoken creature you control dies, put a slime counter on Gutter Grime, then put a green Ooze creature token onto the battlefield with \"This creature's power and toughness are each equal to the number of slime counters on Gutter Grime.\"", 
  "Titan Forge": "{3}, {T}: Put a charge counter on Titan Forge.\n\n{T}, Remove three charge counters from Titan Forge: Put a 9/9 colorless Golem artifact creature token onto the battlefield.", 
  "Ooze Garden": "{1}{G}, Sacrifice a non-Ooze creature: Put an X/X green Ooze creature token onto the battlefield, where X is the sacrificed creature's power. Activate this ability only any time you could cast a sorcery.", 
  "Rakka Mar": "Haste\n\n{R}, {T}: Put a 3/1 red Elemental creature token with haste onto the battlefield.", 
  "Empty the Warrens": "Put two 1/1 red Goblin creature tokens onto the battlefield.\n\nStorm (When you cast this spell, copy it for each spell cast before it this turn.)", 
  "Apocalypse Chime": "{2}, {T}, Sacrifice Apocalypse Chime: Destroy all nontoken permanents originally printed in the Homelands expansion. They can't be regenerated.", 
  "Stone Idol Trap": "Stone Idol Trap costs {1} less to cast for each attacking creature.\n\nPut a 6/12 colorless Construct artifact creature token with trample onto the battlefield. Exile it at the beginning of your next end step.", 
  "Summoning Station": "{T}: Put a 2/2 colorless Pincher creature token onto the battlefield.\n\nWhenever an artifact is put into a graveyard from the battlefield, you may untap Summoning Station.", 
  "Illness in the Ranks": "Creature tokens get -1/-1.", 
  "Grove of the Guardian": "{T}: Add {1} to your mana pool.\n\n{3}{G}{W}, {T}, Tap two untapped creatures you control, Sacrifice Grove of the Guardian: Put an 8/8 green and white Elemental creature token with vigilance onto the battlefield.", 
  "Cloudgoat Ranger": "When Cloudgoat Ranger enters the battlefield, put three 1/1 white Kithkin Soldier creature tokens onto the battlefield.\n\nTap three untapped Kithkin you control: Cloudgoat Ranger gets +2/+0 and gains flying until end of turn.", 
  "One Dozen Eyes": "Choose one — Put a 5/5 green Beast creature token onto the battlefield; or put five 1/1 green Insect creature tokens onto the battlefield.\n\nEntwine {G}{G}{G} (Choose both if you pay the entwine cost.)", 
  "Hero of Bladehold": "Battle cry (Whenever this creature attacks, each other attacking creature gets +1/+0 until end of turn.)\n\nWhenever Hero of Bladehold attacks, put two 1/1 white Soldier creature tokens onto the battlefield tapped and attacking.", 
  "Forbidden Ritual": "Sacrifice a nontoken permanent. If you do, target opponent loses 2 life unless he or she sacrifices a permanent or discards a card. You may repeat this process any number of times.", 
  "Raise the Alarm": "Put two 1/1 white Soldier creature tokens onto the battlefield.", 
  "Fable of Wolf and Owl": "Whenever you cast a green spell, you may put a 2/2 green Wolf creature token onto the battlefield.\n\nWhenever you cast a blue spell, you may put a 1/1 blue Bird creature token with flying onto the battlefield.", 
  "Sporoloth Ancient": "At the beginning of your upkeep, put a spore counter on Sporoloth Ancient.\n\nCreatures you control have \"Remove two spore counters from this creature: Put a 1/1 green Saproling creature token onto the battlefield.\"", 
  "Basalt Golem": "Basalt Golem can't be blocked by artifact creatures.\n\nWhenever Basalt Golem becomes blocked by a creature, that creature's controller sacrifices it at end of combat. If the player does, he or she puts a 0/2 colorless Wall artifact creature token with defender onto the battlefield.", 
  "Caller of the Claw": "Flash\n\nWhen Caller of the Claw enters the battlefield, put a 2/2 green Bear creature token onto the battlefield for each nontoken creature put into your graveyard from the battlefield this turn.", 
  "Wand of the Elements": "{T}, Sacrifice an Island: Put a 2/2 blue Elemental creature token with flying onto the battlefield.\n\n{T}, Sacrifice a Mountain: Put a 3/3 red Elemental creature token onto the battlefield.", 
  "Death Mutation": "Destroy target nonblack creature. It can't be regenerated. Put X 1/1 green Saproling creature tokens onto the battlefield, where X is that creature's converted mana cost.", 
  "Godsire": "Vigilance\n\n{T}: Put an 8/8 Beast creature token that's red, green, and white onto the battlefield.", 
  "Hive Stirrings": "Put two 1/1 colorless Sliver creature tokens onto the battlefield.", 
  "Myr Sire": "When Myr Sire dies, put a 1/1 colorless Myr artifact creature token onto the battlefield.", 
  "Penumbra Spider": "Reach\n\nWhen Penumbra Spider dies, put a 2/4 black Spider creature token with reach onto the battlefield.", 
  "Benthicore": "When Benthicore enters the battlefield, put two 1/1 blue Merfolk Wizard creature tokens onto the battlefield.\n\nTap two untapped Merfolk you control: Untap Benthicore. It gains shroud until end of turn. (It can't be the target of spells or abilities.)", 
  "Warbreak Trumpeter": "Morph {X}{X}{R} (You may cast this face down as a 2/2 creature for {3}. Turn it face up any time for its morph cost.)\n\nWhen Warbreak Trumpeter is turned face up, put X 1/1 red Goblin creature tokens onto the battlefield.", 
  "Waiting in the Weeds": "Each player puts a 1/1 green Cat creature token onto the battlefield for each untapped Forest he or she controls.", 
  "Hunted Phantasm": "Hunted Phantasm can't be blocked.\n\nWhen Hunted Phantasm enters the battlefield, target opponent puts five 1/1 red Goblin creature tokens onto the battlefield.", 
  "Lich": "As Lich enters the battlefield, you lose life equal to your life total.\n\nYou don't lose the game for having 0 or less life.\n\nIf you would gain life, draw that many cards instead.\n\nWhenever you're dealt damage, sacrifice that many nontoken permanents. If you can't, you lose the game.\n\nWhen Lich is put into a graveyard from the battlefield, you lose the game.", 
  "Phyrexian Processor": "As Phyrexian Processor enters the battlefield, pay any amount of life.\n\n{4}, {T}: Put an X/X black Minion creature token onto the battlefield, where X is the life paid as Phyrexian Processor entered the battlefield.", 
  "Ooze Flux": "{1}{G}, Remove one or more +1/+1 counters from among creatures you control: Put an X/X green Ooze creature token onto the battlefield, where X is the number of +1/+1 counters removed this way.", 
  "Questing Phelddagrif": "{G}: Questing Phelddagrif gets +1/+1 until end of turn. Target opponent puts a 1/1 green Hippo creature token onto the battlefield.\n\n{W}: Questing Phelddagrif gains protection from black and from red until end of turn. Target opponent gains 2 life.\n\n{U}: Questing Phelddagrif gains flying until end of turn. Target opponent may draw a card.", 
  "Myr Battlesphere": "When Myr Battlesphere enters the battlefield, put four 1/1 colorless Myr artifact creature tokens onto the battlefield.\n\nWhenever Myr Battlesphere attacks, you may tap X untapped Myr you control. If you do, Myr Battlesphere gets +X/+0 until end of turn and deals X damage to defending player.", 
  "Alliance of Arms": "Join forces — Starting with you, each player may pay any amount of mana. Each player puts X 1/1 white Soldier creature tokens onto the battlefield, where X is the total amount of mana paid this way.", 
  "Druid's Call": "Enchant creature\n\nWhenever enchanted creature is dealt damage, its controller puts that many 1/1 green Squirrel creature tokens onto the battlefield.", 
  "Trigon of Infestation": "Trigon of Infestation enters the battlefield with three charge counters on it.\n\n{G}{G}, {T}: Put a charge counter on Trigon of Infestation.\n\n{2}, {T}, Remove a charge counter from Trigon of Infestation: Put a 1/1 green Insect creature token with infect onto the battlefield.", 
  "Squirrel Farm": "o1oG: Choose a card in your hand. Covering the artist's name, reveal the card to target player. If that player cannot name the artist, reveal the artist's name and put a Squirrel token into play. Treat this token as a 1/1 green creature.", 
  "Voice of the Woods": "Tap five untapped Elves you control: Put a 7/7 green Elemental creature token with trample onto the battlefield.", 
  "Entreat the Angels": "Put X 4/4 white Angel creature tokens with flying onto the battlefield.\n\nMiracle {X}{W}{W} (You may cast this card for its miracle cost when you draw it if it's the first card you drew this turn.)", 
  "Remembrance": "Whenever a nontoken creature you control dies, you may search your library for a card with the same name as that creature, reveal it, and put it into your hand. If you do, shuffle your library.", 
  "Squirrel Nest": "Enchant land\n\nEnchanted land has \"{T}: Put a 1/1 green Squirrel creature token onto the battlefield.\"", 
  "Rest in Peace": "When Rest in Peace enters the battlefield, exile all cards from all graveyards.\n\nIf a card or token would be put into a graveyard from anywhere, exile it instead.", 
  "Ulasht, the Hate Seed": "Ulasht, the Hate Seed enters the battlefield with a +1/+1 counter on it for each other red creature you control and a +1/+1 counter on it for each other green creature you control.\n\n{1}, Remove a +1/+1 counter from Ulasht: Choose one — Ulasht deals 1 damage to target creature; or put a 1/1 green Saproling creature token onto the battlefield.", 
  "Prototype Portal": "Imprint — When Prototype Portal enters the battlefield, you may exile an artifact card from your hand.\n\n{X}, {T}: Put a token that's a copy of the exiled card onto the battlefield. X is the converted mana cost of that card.", 
  "Thopter Foundry": "{1}, Sacrifice a nontoken artifact: Put a 1/1 blue Thopter artifact creature token with flying onto the battlefield. You gain 1 life.", 
  "Spectral Procession": "({2/W} can be paid with any two mana or with {W}. This card's converted mana cost is 6.)\n\nPut three 1/1 white Spirit creature tokens with flying onto the battlefield.", 
  "Hour of Reckoning": "Convoke (Each creature you tap while casting this spell pays for {1} or one mana of that creature's color.)\n\nDestroy all nontoken creatures.", 
  "Hunting Triad": "Put three 1/1 green Elf Warrior creature tokens onto the battlefield.\n\nReinforce 3—{3}{G} ({3}{G}, Discard this card: Put three +1/+1 counters on target creature.)", 
  "Endrek Sahr, Master Breeder": "Whenever you cast a creature spell, put X 1/1 black Thrull creature tokens onto the battlefield, where X is that spell's converted mana cost.\n\nWhen you control seven or more Thrulls, sacrifice Endrek Sahr, Master Breeder.", 
  "Seize the Soul": "Destroy target nonwhite, nonblack creature. Put a 1/1 white Spirit creature token with flying onto the battlefield.\n\nHaunt (When this spell card is put into a graveyard after resolving, exile it haunting target creature.)\n\nWhen the creature Seize the Soul haunts dies, destroy target nonwhite, nonblack creature. Put a 1/1 white Spirit creature token with flying onto the battlefield.", 
  "Geist-Honored Monk": "Vigilance\n\nGeist-Honored Monk's power and toughness are each equal to the number of creatures you control.\n\nWhen Geist-Honored Monk enters the battlefield, put two 1/1 white Spirit creature tokens with flying onto the battlefield.", 
  "Fungal Sprouting": "Put X 1/1 green Saproling creature tokens onto the battlefield, where X is the greatest power among creatures you control.", 
  "Reach of Branches": "Put a 2/5 green Treefolk Shaman creature token onto the battlefield.\n\nWhenever a Forest enters the battlefield under your control, you may return Reach of Branches from your graveyard to your hand.", 
  "Dragonmaster Outcast": "At the beginning of your upkeep, if you control six or more lands, put a 5/5 red Dragon creature token with flying onto the battlefield.", 
  "Teysa, Envoy of Ghosts": "Vigilance, protection from creatures\n\nWhenever a creature deals combat damage to you, destroy that creature. Put a 1/1 white and black Spirit creature token with flying onto the battlefield.", 
  "Thopter Assembly": "Flying\n\nAt the beginning of your upkeep, if you control no Thopters other than Thopter Assembly, return Thopter Assembly to its owner's hand and put five 1/1 colorless Thopter artifact creature tokens with flying onto the battlefield.", 
  "Goldmeadow": "Whenever a land enters the battlefield, that land's controller puts three 0/1 white Goat creature tokens onto the battlefield.\n\nWhenever you roll {C}, put a 0/1 white Goat creature token onto the battlefield.", 
  "Even the Odds": "Cast Even the Odds only if you control fewer creatures than each opponent.\n\nPut three 1/1 white Soldier creature tokens onto the battlefield.", 
  "Master of the Wild Hunt": "At the beginning of your upkeep, put a 2/2 green Wolf creature token onto the battlefield.\n\n{T}: Tap all untapped Wolf creatures you control. Each Wolf tapped this way deals damage equal to its power to target creature. That creature deals damage equal to its power divided as its controller chooses among any number of those Wolves.", 
  "Luminarch Ascension": "At the beginning of each opponent's end step, if you didn't lose life this turn, you may put a quest counter on Luminarch Ascension. (Damage causes loss of life.)\n\n{1}{W}: Put a 4/4 white Angel creature token with flying onto the battlefield. Activate this ability only if Luminarch Ascension has four or more quest counters on it.", 
  "Nest Invader": "When Nest Invader enters the battlefield, put a 0/1 colorless Eldrazi Spawn creature token onto the battlefield. It has \"Sacrifice this creature: Add {1} to your mana pool.\"", 
  "Moorland Haunt": "{T}: Add {1} to your mana pool.\n\n{W}{U}, {T}, Exile a creature card from your graveyard: Put a 1/1 white Spirit creature token with flying onto the battlefield.", 
  "Murasa": "Whenever a nontoken creature enters the battlefield, its controller may search his or her library for a basic land card, put it onto the battlefield tapped, then shuffle his or her library.\n\nWhenever you roll {C}, target land becomes a 4/4 creature that's still a land.", 
  "Spirit Mirror": "At the beginning of your upkeep, if there are no Reflection tokens on the battlefield, put a 2/2 white Reflection creature token onto the battlefield.\n\n{0}: Destroy target Reflection.", 
  "Chaos Orb": "{1}, {T}: If Chaos Orb is on the battlefield, flip Chaos Orb onto the battlefield from a height of at least one foot. If Chaos Orb turns over completely at least once during the flip, destroy all nontoken permanents it touches. Then destroy Chaos Orb.", 
  "Gloomwidow's Feast": "Destroy target creature with flying. If that creature was blue or black, put a 1/2 green Spider creature token with reach onto the battlefield. (It can block creatures with flying.)", 
  "Mortarpod": "Living weapon (When this Equipment enters the battlefield, put a 0/0 black Germ creature token onto the battlefield, then attach this to it.)\n\nEquipped creature gets +0/+1 and has \"Sacrifice this creature: This creature deals 1 damage to target creature or player.\"\n\nEquip {2}", 
  "Snake Pit": "Whenever an opponent casts a blue or black spell, you may put a 1/1 green Snake creature token onto the battlefield.", 
  "Mogg Alarm": "You may sacrifice two Mountains rather than pay Mogg Alarm's mana cost.\n\nPut two 1/1 red Goblin creature tokens onto the battlefield.", 
  "Rite of Replication": "Kicker {5} (You may pay an additional {5} as you cast this spell.)\n\nPut a token that's a copy of target creature onto the battlefield. If Rite of Replication was kicked, put five of those tokens onto the battlefield instead.", 
  "Sword of Body and Mind": "Equipped creature gets +2/+2 and has protection from green and from blue.\n\nWhenever equipped creature deals combat damage to a player, you put a 2/2 green Wolf creature token onto the battlefield and that player puts the top ten cards of his or her library into his or her graveyard.\n\nEquip {2}", 
  "Selesnya Charm": "Choose one — Target creature gets +2/+2 and gains trample until end of turn; or exile target creature with power 5 or greater; or put a 2/2 white Knight creature token with vigilance onto the battlefield.", 
  "Ant Queen": "{1}{G}: Put a 1/1 green Insect creature token onto the battlefield.", 
  "Knight-Captain of Eos": "When Knight-Captain of Eos enters the battlefield, put two 1/1 white Soldier creature tokens onto the battlefield.\n\n{W}, Sacrifice a Soldier: Prevent all combat damage that would be dealt this turn.", 
  "Bearscape": "{1}{G}, Exile two cards from your graveyard: Put a 2/2 green Bear creature token onto the battlefield.", 
  "Corpsehatch": "Destroy target nonblack creature. Put two 0/1 colorless Eldrazi Spawn creature tokens onto the battlefield. They have \"Sacrifice this creature: Add {1} to your mana pool.\"", 
  "Splinter Twin": "Enchant creature\n\nEnchanted creature has \"{T}: Put a token that's a copy of this creature onto the battlefield. That token has haste. Exile it at the beginning of the next end step.\"", 
  "Chancellor of the Forge": "You may reveal this card from your opening hand. If you do, at the beginning of the first upkeep, put a 1/1 red Goblin creature token with haste onto the battlefield.\n\nWhen Chancellor of the Forge enters the battlefield, put X 1/1 red Goblin creature tokens with haste onto the battlefield, where X is the number of creatures you control.", 
  "Sound the Call": "Put a 1/1 green Wolf creature token onto the battlefield. It has \"This creature gets +1/+1 for each card named Sound the Call in each graveyard.\"", 
  "Sporemound": "Whenever a land enters the battlefield under your control, put a 1/1 green Saproling creature token onto the battlefield.", 
  "Krenko's Command": "Put two 1/1 red Goblin creature tokens onto the battlefield.", 
  "Wing Splicer": "When Wing Splicer enters the battlefield, put a 3/3 colorless Golem artifact creature token onto the battlefield.\n\nGolem creatures you control have flying.", 
  "Brindle Shoat": "When Brindle Shoat dies, put a 3/3 green Boar creature token onto the battlefield.", 
  "Call the Skybreaker": "Put a 5/5 blue and red Elemental creature token with flying onto the battlefield.\n\nRetrace (You may cast this card from your graveyard by discarding a land card in addition to paying its other costs.)", 
  "Horncaller's Chant": "Put a 4/4 green Rhino creature token with trample onto the battlefield, then populate. (Put a token onto the battlefield that's a copy of a creature token you control.)", 
  "Spawning Breath": "Spawning Breath deals 1 damage to target creature or player. Put a 0/1 colorless Eldrazi Spawn creature token onto the battlefield. It has \"Sacrifice this creature: Add {1} to your mana pool.\"", 
  "Cemetery Reaper": "Other Zombie creatures you control get +1/+1.\n\n{2}{B}, {T}: Exile target creature card from a graveyard. Put a 2/2 black Zombie creature token onto the battlefield.", 
  "Mirrorworks": "Whenever another nontoken artifact enters the battlefield under your control, you may pay {2}. If you do, put a token that's a copy of that artifact onto the battlefield.", 
  "Wake the Reflections": "Populate. (Put a token onto the battlefield that's a copy of a creature token you control.)", 
  "Teysa, Orzhov Scion Avatar": "Whenever a nontoken creature dies, put a 1/1 white Spirit creature token with flying onto the battlefield.", 
  "Assault // Battery (Battery)": "Put a 3/3 green Elephant creature token onto the battlefield.", 
  "Xathrid Necromancer": "Whenever Xathrid Necromancer or another Human creature you control dies, put a 2/2 black Zombie creature token onto the battlefield tapped.", 
  "Martial Coup": "Put X 1/1 white Soldier creature tokens onto the battlefield. If X is 5 or more, destroy all other creatures.", 
  "Bend or Break": "Each player separates all nontoken lands he or she controls into two piles. For each player, one of his or her piles is chosen by one of his or her opponents of his or her choice. Destroy all lands in the chosen piles. Tap all lands in the other piles.", 
  "Cackling Counterpart": "Put a token onto the battlefield that's a copy of target creature you control.\n\nFlashback {5}{U}{U} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", 
  "Fresh Meat": "Put a 3/3 green Beast creature token onto the battlefield for each creature put into your graveyard from the battlefield this turn.", 
  "Parasitic Implant": "Enchant creature\n\nAt the beginning of your upkeep, enchanted creature's controller sacrifices it and you put a 1/1 colorless Myr artifact creature token onto the battlefield.", 
  "Avacyn's Collar": "Equipped creature gets +1/+0 and has vigilance.\n\nWhenever equipped creature dies, if it was a Human, put a 1/1 white Spirit creature token with flying onto the battlefield.\n\nEquip {2}", 
  "Trading Post": "{1}, {T}, Discard a card: You gain 4 life.\n\n{1}, {T}, Pay 1 life: Put a 0/1 white Goat creature token onto the battlefield.\n\n{1}, {T}, Sacrifice a creature: Return target artifact card from your graveyard to your hand.\n\n{1}, {T}, Sacrifice an artifact: Draw a card.", 
  "Legion Loyalist": "Haste\n\nBattalion — Whenever Legion Loyalist and at least two other creatures attack, creatures you control gain first strike and trample until end of turn and can't be blocked by creature tokens this turn.", 
  "Bronze Tablet": "Remove Bronze Tablet from your deck before playing if you're not playing for ante.\n\nBronze Tablet enters the battlefield tapped.\n\n{4}, {T}: Exile Bronze Tablet and target nontoken permanent an opponent owns. That player may pay 10 life. If he or she does, put Bronze Tablet into its owner's graveyard. Otherwise, that player owns Bronze Tablet and you own the other exiled card.", 
  "Flayer Husk": "Living weapon (When this Equipment enters the battlefield, put a 0/0 black Germ creature token onto the battlefield, then attach this to it.)\n\nEquipped creature gets +1/+1.\n\nEquip {2}", 
  "Verdant Force": "At the beginning of each upkeep, put a 1/1 green Saproling creature token onto the battlefield.", 
  "Darien, King of Kjeldor": "Whenever you're dealt damage, you may put that many 1/1 white Soldier creature tokens onto the battlefield.", 
  "Hunted Troll": "When Hunted Troll enters the battlefield, target opponent puts four 1/1 blue Faerie creature tokens with flying onto the battlefield.\n\n{G}: Regenerate Hunted Troll.", 
  "Urza's Factory": "{T}: Add {1} to your mana pool.\n\n{7}, {T}: Put a 2/2 colorless Assembly-Worker artifact creature token onto the battlefield.", 
  "Twilight Drover": "Whenever a creature token leaves the battlefield, put a +1/+1 counter on Twilight Drover.\n\n{2}{W}, Remove a +1/+1 counter from Twilight Drover: Put two 1/1 white Spirit creature tokens with flying onto the battlefield.", 
  "Feast or Famine": "Choose one — Put a 2/2 black Zombie creature token onto the battlefield; or destroy target nonartifact, nonblack creature and it can't be regenerated.", 
  "Rebellion of the Flamekin": "Whenever you clash, you may pay {1}. If you do, put a 3/1 red Elemental Shaman creature token onto the battlefield. If you won, that token gains haste until end of turn. (This ability triggers after the clash ends.)", 
  "Nath of the Gilt-Leaf": "At the beginning of your upkeep, you may have target opponent discard a card at random.\n\nWhenever an opponent discards a card, you may put a 1/1 green Elf Warrior creature token onto the battlefield.", 
  "Syphon Flesh": "Each other player sacrifices a creature. You put a 2/2 black Zombie creature token onto the battlefield for each creature sacrificed this way.", 
  "Jedit Ojanen of Efrava": "Forestwalk\n\nWhenever Jedit Ojanen of Efrava attacks or blocks, put a 2/2 green Cat Warrior creature token with forestwalk onto the battlefield.", 
  "Dragonlair Spider": "Reach\n\nWhenever an opponent casts a spell, put a 1/1 green Insect creature token onto the battlefield.", 
  "Growth Spasm": "Search your library for a basic land card, put it onto the battlefield tapped, then shuffle your library. Put a 0/1 colorless Eldrazi Spawn creature token onto the battlefield. It has \"Sacrifice this creature: Add {1} to your mana pool.\"", 
  "Reap the Seagraf": "Put a 2/2 black Zombie creature token onto the battlefield.\n\nFlashback {4}{U} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", 
  "Wirefly Hive": "{3}, {T}: Flip a coin. If you win the flip, put a 2/2 colorless Insect artifact creature token with flying named Wirefly onto the battlefield. If you lose the flip, destroy all permanents named Wirefly.", 
  "Budoka Gardener (Dokai, Weaver of Life)": "{4}{G}{G}, {T}: Put an X/X green Elemental creature token onto the battlefield, where X is the number of lands you control.", 
  "Deathspore Thallid": "At the beginning of your upkeep, put a spore counter on Deathspore Thallid.\n\nRemove three spore counters from Deathspore Thallid: Put a 1/1 green Saproling creature token onto the battlefield.\n\nSacrifice a Saproling: Target creature gets -1/-1 until end of turn.", 
  "Stormfront Riders": "Flying\n\nWhen Stormfront Riders enters the battlefield, return two creatures you control to their owner's hand.\n\nWhenever Stormfront Riders or another creature is returned to your hand from the battlefield, put a 1/1 white Soldier creature token onto the battlefield.", 
  "Aura Mutation": "Destroy target enchantment. Put X 1/1 green Saproling creature tokens onto the battlefield, where X is that enchantment's converted mana cost.", 
  "Kjeldoran Home Guard": "At end of combat, if Kjeldoran Home Guard attacked or blocked this combat, put a -0/-1 counter on Kjeldoran Home Guard and put a 0/1 white Deserter creature token onto the battlefield.", 
  "Wort, the Raidmother": "When Wort, the Raidmother enters the battlefield, put two 1/1 red and green Goblin Warrior creature tokens onto the battlefield.\n\nEach red or green instant or sorcery spell you cast has conspire. (As you cast the spell, you may tap two untapped creatures you control that share a color with it. When you do, copy it and you may choose new targets for the copy.)", 
  "Genesis Chamber": "Whenever a nontoken creature enters the battlefield, if Genesis Chamber is untapped, that creature's controller puts a 1/1 colorless Myr artifact creature token onto the battlefield.", 
  "Sarkhan Vol": "+1: Creatures you control get +1/+1 and gain haste until end of turn.\n\n-2: Gain control of target creature until end of turn. Untap that creature. It gains haste until end of turn.\n\n-6: Put five 4/4 red Dragon creature tokens with flying onto the battlefield.", 
  "Bramble Elemental": "Whenever an Aura becomes attached to Bramble Elemental, put two 1/1 green Saproling creature tokens onto the battlefield.", 
  "Rootborn Defenses": "Populate. Creatures you control gain indestructible until end of turn. (To populate, put a token onto the battlefield that's a copy of a creature token you control. Damage and effects that say \"destroy\" don't destroy creatures with indestructible.)", 
  "Tooth and Claw": "Sacrifice two creatures: Put a 3/1 red Beast creature token named Carnivore onto the battlefield.", 
  "Thatcher Revolt": "Put three 1/1 red Human creature tokens with haste onto the battlefield. Sacrifice those tokens at the beginning of the next end step.", 
  "Tidal Wave": "Put a 5/5 blue Wall creature token with defender onto the battlefield. Sacrifice it at the beginning of the next end step.", 
  "Pure Reflection": "Whenever a player casts a creature spell, destroy all Reflections. Then that player puts an X/X white Reflection creature token onto the battlefield, where X is the converted mana cost of that spell.", 
  "Elvish Champion Avatar": "You begin the game with a 1/1 green Elf creature token on the battlefield. It has \"{T}: Add {G} to your mana pool.\"", 
  "Liege of the Hollows": "When Liege of the Hollows dies, each player may pay any amount of mana. Then each player who paid mana this way puts that many 1/1 green Squirrel creature tokens onto the battlefield.", 
  "Dual Nature": "Whenever a nontoken creature enters the battlefield, its controller puts a token that's a copy of that creature onto the battlefield.\n\nWhenever a nontoken creature leaves the battlefield, exile all tokens with the same name as that creature.\n\nWhen Dual Nature leaves the battlefield, exile all tokens put onto the battlefield with Dual Nature.", 
  "Sprout Swarm": "Convoke (Each creature you tap while casting this spell pays for {1} or one mana of that creature's color.)\n\nBuyback {3} (You may pay an additional {3} as you cast this spell. If you do, put this card into your hand as it resolves.)\n\nPut a 1/1 green Saproling creature token onto the battlefield.", 
  "Oyobi, Who Split the Heavens": "Flying\n\nWhenever you cast a Spirit or Arcane spell, put a 3/3 white Spirit creature token with flying onto the battlefield.", 
  "Penumbra Bobcat": "When Penumbra Bobcat dies, put a 2/1 black Cat creature token onto the battlefield.", 
  "Promise of Bunrei": "When a creature you control dies, sacrifice Promise of Bunrei. If you do, put four 1/1 colorless Spirit creature tokens onto the battlefield.", 
  "Alive // Well (Alive)": "Put a 3/3 green Centaur creature token onto the battlefield.\n\nFuse (You may cast one or both halves of this card from your hand.)", 
  "Mystic Genesis": "Counter target spell. Put an X/X green Ooze creature token onto the battlefield, where X is that spell's converted mana cost.", 
  "Nuisance Engine": "{2}, {T}: Put a 0/1 colorless Pest artifact creature token onto the battlefield.", 
  "Vital Splicer": "When Vital Splicer enters the battlefield, put a 3/3 colorless Golem artifact creature token onto the battlefield.\n\n{1}: Regenerate target Golem you control.", 
  "March of Souls": "Destroy all creatures. They can't be regenerated. For each creature destroyed this way, its controller puts a 1/1 white Spirit creature token with flying onto the battlefield.", 
  "Kirtar's Wrath": "Destroy all creatures. They can't be regenerated.\n\nThreshold — If seven or more cards are in your graveyard, instead destroy all creatures, then put two 1/1 white Spirit creature tokens with flying onto the battlefield. Creatures destroyed this way can't be regenerated.", 
  "Miming Slime": "Put an X/X green Ooze creature token onto the battlefield, where X is the greatest power among creatures you control.", 
  "Moan of the Unhallowed": "Put two 2/2 black Zombie creature tokens onto the battlefield.\n\nFlashback {5}{B}{B} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", 
  "Cloudseeder": "Flying\n\n{U}, {T}, Discard a card: Put a 1/1 blue Faerie creature token named Cloud Sprite onto the battlefield. It has flying and \"Cloud Sprite can block only creatures with flying.\"", 
  "Sliver Queen Avatar": "Whenever you cast a non-Sliver creature spell, exile that spell. If you do, put a token onto the battlefield that's a copy of a random non-Shapeshifter Sliver creature card with the same converted mana cost as that spell.", 
  "Pentavus": "Pentavus enters the battlefield with five +1/+1 counters on it.\n\n{1}, Remove a +1/+1 counter from Pentavus: Put a 1/1 colorless Pentavite artifact creature token with flying onto the battlefield.\n\n{1}, Sacrifice a Pentavite: Put a +1/+1 counter on Pentavus.", 
  "Spectral Bears": "Whenever Spectral Bears attacks, if defending player controls no black nontoken permanents, it doesn't untap during your next untap step.", 
  "Brutal Suppression": "Activated abilities of nontoken Rebels cost an additional \"Sacrifice a land\" to activate.", 
  "Nacatl War-Pride": "Nacatl War-Pride must be blocked by exactly one creature if able.\n\nWhenever Nacatl War-Pride attacks, put X tokens that are copies of Nacatl War-Pride onto the battlefield tapped and attacking, where X is the number of creatures defending player controls. Exile the tokens at the beginning of the next end step.", 
  "Decaying Soil": "At the beginning of your upkeep, exile a card from your graveyard.\n\nThreshold — As long as seven or more cards are in your graveyard, Decaying Soil has \"Whenever a nontoken creature is put into your graveyard from the battlefield, you may pay {1}. If you do, return that card to your hand.\"", 
  "Orochi Hatchery": "Orochi Hatchery enters the battlefield with X charge counters on it.\n\n{5}, {T}: Put a 1/1 green Snake creature token onto the battlefield for each charge counter on Orochi Hatchery.", 
  "Afterlife": "Destroy target creature. It can't be regenerated. Its controller puts a 1/1 white Spirit creature token with flying onto the battlefield.", 
  "Nim Deathmantle": "Equipped creature gets +2/+2, has intimidate, and is a black Zombie.\n\nWhenever a nontoken creature is put into your graveyard from the battlefield, you may pay {4}. If you do, return that card to the battlefield and attach Nim Deathmantle to it.\n\nEquip {4}", 
  "Research // Development (Development)": "Put a 3/1 red Elemental creature token onto the battlefield unless any opponent has you draw a card. Repeat this process two more times.", 
  "Parallel Lives": "If an effect would put one or more tokens onto the battlefield under your control, it puts twice that many of those tokens onto the battlefield instead.", 
  "Lingering Souls": "Put two 1/1 white Spirit creature tokens with flying onto the battlefield.\n\nFlashback {1}{B} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", 
  "Followed Footsteps": "Enchant creature\n\nAt the beginning of your upkeep, put a token that's a copy of enchanted creature onto the battlefield.", 
  "Worm Harvest": "Put a 1/1 black and green Worm creature token onto the battlefield for each land card in your graveyard.\n\nRetrace (You may cast this card from your graveyard by discarding a land card in addition to paying its other costs.)", 
  "Kamahl's Summons": "Each player may reveal any number of creature cards from his or her hand. Then each player puts a 2/2 green Bear creature token onto the battlefield for each card he or she revealed this way.", 
  "Sengir Nosferatu": "Flying\n\n{1}{B}, Exile Sengir Nosferatu: Put a 1/2 black Bat creature token with flying onto the battlefield. It has \"{1}{B}, Sacrifice this creature: Return an exiled card named Sengir Nosferatu to the battlefield under its owner's control.\"", 
  "Thragtusk": "When Thragtusk enters the battlefield, you gain 5 life.\n\nWhen Thragtusk leaves the battlefield, put a 3/3 green Beast creature token onto the battlefield.", 
  "Voice of the Provinces": "Flying\n\nWhen Voice of the Provinces enters the battlefield, put a 1/1 white Human creature token onto the battlefield.", 
  "Æther Snap": "Remove all counters from all permanents and exile all tokens.", 
  "Belfry Spirit": "Flying\n\nHaunt (When this creature dies, exile it haunting target creature.)\n\nWhen Belfry Spirit enters the battlefield or the creature it haunts dies, put two 1/1 black Bat creature tokens with flying onto the battlefield.", 
  "Curse of the Swine": "Exile X target creatures. For each creature exiled this way, its controller puts a 2/2 green Boar creature token onto the battlefield.", 
  "Arboria": "Creatures can't attack a player unless that player cast a spell or put a nontoken permanent onto the battlefield during his or her last turn.", 
  "Hellion Crucible": "{T}: Add {1} to your mana pool.\n\n{1}{R}, {T}: Put a pressure counter on Hellion Crucible.\n\n{1}{R}, {T}, Remove two pressure counters from Hellion Crucible and sacrifice it: Put a 4/4 red Hellion creature token with haste onto the battlefield. (It can attack and {T} as soon as it comes under your control.)", 
  "Hedron Fields of Agadeem": "Creatures with power 7 or greater can't attack or block.\n\nWhenever you roll chaos, put a 7/7 colorless Eldrazi creature token with annihilator 1 onto the battlefield. (Whenever it attacks, defending player sacrifices a permanent.)", 
  "Vitaspore Thallid": "At the beginning of your upkeep, put a spore counter on Vitaspore Thallid.\n\nRemove three spore counters from Vitaspore Thallid: Put a 1/1 green Saproling creature token onto the battlefield.\n\nSacrifice a Saproling: Target creature gains haste until end of turn.", 
  "Grixis Slavedriver": "When Grixis Slavedriver leaves the battlefield, put a 2/2 black Zombie creature token onto the battlefield.\n\nUnearth {3}{B} ({3}{B}: Return this card from your graveyard to the battlefield. It gains haste. Exile it at the beginning of the next end step or if it would leave the battlefield. Unearth only as a sorcery.)", 
  "Essence Feed": "Target player loses 3 life. You gain 3 life and put three 0/1 colorless Eldrazi Spawn creature tokens onto the battlefield. They have \"Sacrifice this creature: Add {1} to your mana pool.\"", 
  "Deranged Hermit": "Echo {3}{G}{G} (At the beginning of your upkeep, if this came under your control since the beginning of your last upkeep, sacrifice it unless you pay its echo cost.)\n\nWhen Deranged Hermit enters the battlefield, put four 1/1 green Squirrel creature tokens onto the battlefield.\n\nSquirrel creatures get +1/+1.", 
  "Prossh, Skyraider of Kher": "Flying\n\nWhen you cast Prossh, Skyraider of Kher, put X 0/1 red Kobold creature tokens named Kobolds of Kher Keep onto the battlefield, where X is the amount of mana spent to cast Prossh.\n\nSacrifice another creature: Prossh gets +1/+0 until end of turn.", 
  "Acorn Harvest": "Put two 1/1 green Squirrel creature tokens onto the battlefield.\n\nFlashback—{1}{G}, Pay 3 life. (You may cast this card from your graveyard for its flashback cost. Then exile it.)", 
  "Squirrel Wrangler": "{1}{G}, Sacrifice a land: Put two 1/1 green Squirrel creature tokens onto the battlefield.\n\n{1}{G}, Sacrifice a land: Squirrel creatures get +1/+1 until end of turn.", 
  "Midsummer Revel": "At the beginning of your upkeep, you may put a verse counter on Midsummer Revel.\n\n{G}, Sacrifice Midsummer Revel: Put X 3/3 green Beast creature tokens onto the battlefield, where X is the number of verse counters on Midsummer Revel.", 
  "Doubling Season": "If an effect would put one or more tokens onto the battlefield under your control, it puts twice that many of those tokens onto the battlefield instead.\n\nIf an effect would place one or more counters on a permanent you control, it places twice that many of those counters on that permanent instead.", 
  "Bestial Menace": "Put a 1/1 green Snake creature token, a 2/2 green Wolf creature token, and a 3/3 green Elephant creature token onto the battlefield.", 
  "Notorious Throng": "Prowl {5}{U} (You may cast this for its prowl cost if you dealt combat damage to a player this turn with a Rogue.)\n\nPut X 1/1 black Faerie Rogue creature tokens with flying onto the battlefield, where X is the damage dealt to your opponents this turn. If Notorious Throng's prowl cost was paid, take an extra turn after this one.", 
  "Puppet Conjurer": "{U}, {T}: Put a 0/1 blue Homunculus artifact creature token onto the battlefield.\n\nAt the beginning of your upkeep, sacrifice a Homunculus.", 
  "Phyrexian Ingester": "Imprint — When Phyrexian Ingester enters the battlefield, you may exile target nontoken creature.\n\nPhyrexian Ingester gets +X/+Y, where X is the exiled creature card's power and Y is its toughness.", 
  "Keeper of the Beasts": "{G}, {T}: Choose target opponent who controlled more creatures than you did as you activated this ability. Put a 2/2 green Beast creature token onto the battlefield.", 
  "Stonehewer Giant Avatar": "Whenever a creature enters the battlefield under your control, put a token onto the battlefield that's a copy of a random Equipment card with converted mana cost less than or equal to that creature's converted mana cost. Attach that Equipment to that creature.", 
  "Myrsmith": "Whenever you cast an artifact spell, you may pay {1}. If you do, put a 1/1 colorless Myr artifact creature token onto the battlefield.", 
  "Thallid": "At the beginning of your upkeep, put a spore counter on Thallid.\n\nRemove three spore counters from Thallid: Put a 1/1 green Saproling creature token onto the battlefield.", 
  "Tukatongue Thallid": "When Tukatongue Thallid dies, put a 1/1 green Saproling creature token onto the battlefield.", 
  "Broken Visage": "Destroy target nonartifact attacking creature. It can't be regenerated. Put a black Spirit creature token with that creature's power and toughness onto the battlefield. Sacrifice the token at the beginning of the next end step.", 
  "Scatter the Seeds": "Convoke (Each creature you tap while casting this spell pays for {1} or one mana of that creature's color.)\n\nPut three 1/1 green Saproling creature tokens onto the battlefield.", 
  "Riptide Replicator": "As Riptide Replicator enters the battlefield, choose a color and a creature type.\n\nRiptide Replicator enters the battlefield with X charge counters on it.\n\n{4}, {T}: Put an X/X creature token of the chosen color and type onto the battlefield, where X is the number of charge counters on Riptide Replicator.", 
  "Soul of the Harvest": "Trample\n\nWhenever another nontoken creature enters the battlefield under your control, you may draw a card.", 
  "Sprouting Phytohydra": "Defender (This creature can't attack.)\n\nWhenever Sprouting Phytohydra is dealt damage, you may put a token that's a copy of Sprouting Phytohydra onto the battlefield.", 
  "Artifact Mutation": "Destroy target artifact. It can't be regenerated. Put X 1/1 green Saproling creature tokens onto the battlefield, where X is that artifact's converted mana cost.", 
  "Scion of Vitu-Ghazi": "When Scion of Vitu-Ghazi enters the battlefield, if you cast it from your hand, put a 1/1 white Bird creature token with flying onto the battlefield, then populate. (Put a token onto the battlefield that's a copy of a creature token you control.)", 
  "Thraben Doomsayer": "{T}: Put a 1/1 white Human creature token onto the battlefield.\n\nFateful hour — As long as you have 5 or less life, other creatures you control get +2/+2.", 
  "Rapid Hybridization": "Destroy target creature. It can't be regenerated. That creature's controller puts a 3/3 green Frog Lizard creature token onto the battlefield.", 
  "Wurmweaver Coil": "Enchant green creature\n\nEnchanted creature gets +6/+6.\n\n{G}{G}{G}, Sacrifice Wurmweaver Coil: Put a 6/6 green Wurm creature token onto the battlefield.", 
  "Sundering Growth": "Destroy target artifact or enchantment, then populate. (Put a token onto the battlefield that's a copy of a creature token you control.)", 
  "Spawnsire of Ulamog": "Annihilator 1 (Whenever this creature attacks, defending player sacrifices a permanent.)\n\n{4}: Put two 0/1 colorless Eldrazi Spawn creature tokens onto the battlefield. They have \"Sacrifice this creature: Add {1} to your mana pool.\"\n\n{2}0}: Cast any number of Eldrazi cards you own from outside the game without paying their mana costs.", 
  "Icatian Town": "Put four 1/1 white Citizen creature tokens onto the battlefield.", 
  "Hazezon Tamar": "When Hazezon Tamar enters the battlefield, put X 1/1 Sand Warrior creature tokens that are red, green, and white onto the battlefield at the beginning of your next upkeep, where X is the number of lands you control at that time.\n\nWhen Hazezon leaves the battlefield, exile all Sand Warriors.", 
  "Rith, the Awakener": "Flying\n\nWhenever Rith, the Awakener deals combat damage to a player, you may pay {2}{G}. If you do, choose a color, then put a 1/1 green Saproling creature token onto the battlefield for each permanent of that color.", 
  "Coursers' Accord": "Put a 3/3 green Centaur creature token onto the battlefield, then populate. (Put a token onto the battlefield that's a copy of a creature token you control.)", 
  "Dragon Fodder": "Put two 1/1 red Goblin creature tokens onto the battlefield.", 
  "Geist Snatch": "Counter target creature spell. Put a 1/1 blue Spirit creature token with flying onto the battlefield.", 
  "Dragon Broodmother": "Flying\n\nAt the beginning of each upkeep, put a 1/1 red and green Dragon creature token with flying and devour 2 onto the battlefield. (As the token enters the battlefield, you may sacrifice any number of creatures. It enters the battlefield with twice that many +1/+1 counters on it.)", 
  "Kazuul, Tyrant of the Cliffs": "Whenever a creature an opponent controls attacks, if you're the defending player, put a 3/3 red Ogre creature token onto the battlefield unless that creature's controller pays {3}.", 
  "Ogre Slumlord": "Whenever another nontoken creature dies, you may put a 1/1 black Rat creature token onto the battlefield.\n\nRats you control have deathtouch.", 
  "Mogg War Marshal": "Echo {1}{R} (At the beginning of your upkeep, if this came under your control since the beginning of your last upkeep, sacrifice it unless you pay its echo cost.)\n\nWhen Mogg War Marshal enters the battlefield or dies, put a 1/1 red Goblin creature token onto the battlefield.", 
  "Angelic Accord": "At the beginning of each end step, if you gained 4 or more life this turn, put a 4/4 white Angel creature token with flying onto the battlefield.", 
  "Dragon Egg": "Defender (This creature can't attack.)\n\nWhen Dragon Egg dies, put a 2/2 red Dragon creature token with flying onto the battlefield. It has \"{R}: This creature gets +1/+0 until end of turn.\"", 
  "Roots of All Evil": "When you set this scheme in motion, put five 1/1 green Saproling creature tokens onto the battlefield.", 
  "Elspeth, Sun's Champion": "+1: Put three 1/1 white Soldier creature tokens onto the battlefield.\n\n-3: Destroy all creatures with power 4 or greater.\n\n-7: You get an emblem with \"Creatures you control get +2/+2 and have flying.\"", 
  "Sarkhan the Mad": "0: Reveal the top card of your library and put it into your hand. Sarkhan the Mad deals damage to himself equal to that card's converted mana cost.\n\n-2: Target creature's controller sacrifices it, then that player puts a 5/5 red Dragon creature token with flying onto the battlefield.\n\n-4: Each Dragon creature you control deals damage equal to its power to target player.", 
  "Leyline of the Meek": "If Leyline of the Meek is in your opening hand, you may begin the game with it on the battlefield.\n\nCreature tokens get +1/+1.", 
  "Young Pyromancer": "Whenever you cast an instant or sorcery spell, put a 1/1 red Elemental creature token onto the battlefield.", 
  "Carrion": "As an additional cost to cast Carrion, sacrifice a creature.\n\nPut X 0/1 black Insect creature tokens onto the battlefield, where X is the sacrificed creature's power.", 
  "Flicker": "Exile target nontoken permanent, then return it to the battlefield under its owner's control.", 
  "Rally the Horde": "Exile the top card of your library. Exile the top card of your library. Exile the top card of your library. If the last card exiled isn't a land, repeat this process. Put a 1/1 red Warrior creature token onto the battlefield for each nonland card exiled this way.", 
  "Goblin Rally": "Put four 1/1 red Goblin creature tokens onto the battlefield.", 
  "Curse of Shallow Graves": "Enchant player\n\nWhenever a player attacks enchanted player with one or more creatures, that attacking player may put a 2/2 black Zombie creature token onto the battlefield tapped.", 
  "Sorin, Lord of Innistrad": "+1: Put a 1/1 black Vampire creature token with lifelink onto the battlefield.\n\n-2: You get an emblem with \"Creatures you control get +1/+0.\"\n\n-6: Destroy up to three target creatures and/or other planeswalkers. Return each card put into a graveyard this way to the battlefield under your control.", 
  "Infernal Tribute": "{2}, Sacrifice a nontoken permanent: Draw a card.", 
  "Goblin Trenches": "{2}, Sacrifice a land: Put two 1/1 red and white Goblin Soldier creature tokens onto the battlefield.", 
  "Necrogenesis": "{2}: Exile target creature card from a graveyard. Put a 1/1 green Saproling creature token onto the battlefield."
}